{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 3/Problem Set 3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Mar 2021, 19:19:30
{txt}
{com}. *1a
. clear
{txt}
{com}. set obs 30
{txt}{p}
number of observations (_N)  was 0,
now 30
{p_end}

{com}. gen t=[_n]
{txt}
{com}. tsset t
{res}{txt}{col 9}time variable:  {res}{col 25}t, 1 to 30
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen r=rnormal()
{txt}
{com}. gen y=r if t<4
{txt}(27 missing values generated)

{com}. replace y=0.5+0.5*l.y-0.1*l2.y+0.25*l3.y+r if t>=4 
{txt}(27 real changes made)

{com}. drop r
{txt}
{com}. 
. *model
. reg d.y l1d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        28
{txt}{hline 13}{c +}{hline 34}   F(1, 26)        = {res}     7.29
{txt}       Model {c |} {res} 5.98982946         1  5.98982946   {txt}Prob > F        ={res}    0.0120
{txt}    Residual {c |} {res} 21.3591043        26  .821504011   {txt}R-squared       ={res}    0.2190
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1890
{txt}       Total {c |} {res} 27.3489337        27  1.01292347   {txt}Root MSE        =   {res} .90637

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.4480631{col 26}{space 2} .1659346{col 37}{space 1}   -2.70{col 46}{space 3}0.012{col 54}{space 4}-.7891465{col 67}{space 3}-.1069798
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0946765{col 26}{space 2} .1720709{col 37}{space 1}    0.55{col 46}{space 3}0.587{col 54}{space 4}-.2590203{col 67}{space 3} .4483734
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *aic/bic
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}        28{col 28} -39.4009{col 39}-35.94011{col 50}     2{col 58} 75.88022{col 69} 78.54463
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df1=el(r(S),1,4)
{txt}
{com}. scalar define aic1=el(r(S),1,5)
{txt}
{com}. scalar define bic1=el(r(S),1,6)
{txt}
{com}. *10 fold cv rmse
. crossfold reg d.y l1d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7602895}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .6312166}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.110403}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.269966}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .4469951}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse1=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse1
{txt}    krmse1 = {res} .63419929
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. *loocv
. loocv reg d.y l1d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}.95384454
{txt}Mean Absolute Errors     {c |}{col 30}{res}.77314162
{txt}Pseudo-R2                {c |} {col 30}{res}.0999433
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse1=r(rmse)
{txt}
{com}. 
. reg d.y l2d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        27
{txt}{hline 13}{c +}{hline 34}   F(1, 25)        = {res}     0.14
{txt}       Model {c |} {res} .141091522         1  .141091522   {txt}Prob > F        ={res}    0.7148
{txt}    Residual {c |} {res} 25.8136069        25  1.03254427   {txt}R-squared       ={res}    0.0054
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0343
{txt}       Total {c |} {res} 25.9546984        26   .99825763   {txt}Root MSE        =   {res} 1.0161

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 8}L2D. {c |}{col 14}{res}{space 2}  -.06877{col 26}{space 2} .1860386{col 37}{space 1}   -0.37{col 46}{space 3}0.715{col 54}{space 4}-.4519236{col 67}{space 3} .3143836
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1002526{col 26}{space 2} .1964497{col 37}{space 1}    0.51{col 46}{space 3}0.614{col 54}{space 4}-.3043431{col 67}{space 3} .5048482
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}        27{col 28} -37.7783{col 39}-37.70472{col 50}     2{col 58} 79.40943{col 69} 82.00111
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df2=el(r(S),1,4)
{txt}
{com}. scalar define aic2=el(r(S),1,5)
{txt}
{com}. scalar define bic2=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l2d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .9021655}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7459198}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.167232}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.243048}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.326711}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse2=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse2
{txt}    krmse2 = {res} .77704956
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l2d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.110311
{txt}Mean Absolute Errors     {c |}{col 30}{res}.8857642
{txt}Pseudo-R2                {c |} {col 30}{res}.30515038
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse2=r(rmse)
{txt}
{com}. 
. reg d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        26
{txt}{hline 13}{c +}{hline 34}   F(1, 24)        = {res}     0.09
{txt}       Model {c |} {res} .100885437         1  .100885437   {txt}Prob > F        ={res}    0.7619
{txt}    Residual {c |} {res}  25.778986        24  1.07412442   {txt}R-squared       ={res}    0.0039
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0376
{txt}       Total {c |} {res} 25.8798714        25  1.03519486   {txt}Root MSE        =   {res} 1.0364

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 8}L3D. {c |}{col 14}{res}{space 2} .0592101{col 26}{space 2} .1932007{col 37}{space 1}    0.31{col 46}{space 3}0.762{col 54}{space 4}-.3395366{col 67}{space 3} .4579567
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0747593{col 26}{space 2} .2050307{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4}-.3484032{col 67}{space 3} .4979218
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}        26{col 28} -36.8322{col 39}-36.78142{col 50}     2{col 58} 77.56284{col 69} 80.07904
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df3=el(r(S),1,4)
{txt}
{com}. scalar define aic3=el(r(S),1,5)
{txt}
{com}. scalar define bic3=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.260278}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .5783534}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .4936832}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.409555}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.043313}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse3=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse3
{txt}    krmse3 = {res} .72400711
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.1233063
{txt}Mean Absolute Errors     {c |}{col 30}{res}.89965294
{txt}Pseudo-R2                {c |} {col 30}{res}.59352903
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse3=r(rmse)
{txt}
{com}. 
. reg d.y l1d.y l2d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        27
{txt}{hline 13}{c +}{hline 34}   F(2, 24)        = {res}     4.75
{txt}       Model {c |} {res} 7.35816653         2  3.67908326   {txt}Prob > F        ={res}    0.0183
{txt}    Residual {c |} {res} 18.5965319        24  .774855494   {txt}R-squared       ={res}    0.2835
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2238
{txt}       Total {c |} {res} 25.9546984        26   .99825763   {txt}Root MSE        =   {res} .88026

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.5821105{col 26}{space 2} .1907371{col 37}{space 1}   -3.05{col 46}{space 3}0.005{col 54}{space 4}-.9757726{col 67}{space 3}-.1884485
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.3293629{col 26}{space 2} .1823834{col 37}{space 1}   -1.81{col 46}{space 3}0.083{col 54}{space 4}-.7057837{col 67}{space 3}  .047058
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1501327{col 26}{space 2} .1709626{col 37}{space 1}    0.88{col 46}{space 3}0.389{col 54}{space 4}-.2027167{col 67}{space 3}  .502982
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}        27{col 28} -37.7783{col 39}-33.27771{col 50}     3{col 58} 72.55541{col 69} 76.44292
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df12=el(r(S),1,4)
{txt}
{com}. scalar define aic12=el(r(S),1,5)
{txt}
{com}. scalar define bic12=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l1d.y l2d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .2755585}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.280924}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8959287}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8905425}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  .782406}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse12=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse12
{txt}   krmse12 = {res} .62646722
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l1d.y l2d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}.97005343
{txt}Mean Absolute Errors     {c |}{col 30}{res}.76316726
{txt}Pseudo-R2                {c |} {col 30}{res}.13999295
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse12=r(rmse)
{txt}
{com}. 
. reg d.y l1d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        26
{txt}{hline 13}{c +}{hline 34}   F(2, 23)        = {res}     2.64
{txt}       Model {c |} {res} 4.83662497         2  2.41831248   {txt}Prob > F        ={res}    0.0926
{txt}    Residual {c |} {res} 21.0432464        23  .914923758   {txt}R-squared       ={res}    0.1869
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1162
{txt}       Total {c |} {res} 25.8798714        25  1.03519486   {txt}Root MSE        =   {res} .95652

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.4285231{col 26}{space 2} .1883531{col 37}{space 1}   -2.28{col 46}{space 3}0.033{col 54}{space 4}-.8181613{col 67}{space 3} -.038885
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .0320856{col 26}{space 2} .1787074{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.3375988{col 67}{space 3}   .40177
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1149156{col 26}{space 2} .1900488{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 54}{space 4}-.2782303{col 67}{space 3} .5080615
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}        26{col 28} -36.8322{col 39}-34.14268{col 50}     3{col 58} 74.28537{col 69} 78.05965
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df13=el(r(S),1,4)
{txt}
{com}. scalar define aic13=el(r(S),1,5)
{txt}
{com}. scalar define bic13=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l1d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .8978038}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7710074}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.453003}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .9490036}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .5381048}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse13=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse13
{txt}   krmse13 = {res} .68570296
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l1d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.0320119
{txt}Mean Absolute Errors     {c |}{col 30}{res}.83683368
{txt}Pseudo-R2                {c |} {col 30}{res}.07234527
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse13=r(rmse)
{txt}
{com}. 
. reg d.y       l2d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        26
{txt}{hline 13}{c +}{hline 34}   F(2, 23)        = {res}     0.11
{txt}       Model {c |} {res} .237741921         2  .118870961   {txt}Prob > F        ={res}    0.8993
{txt}    Residual {c |} {res} 25.6421295        23   1.1148752   {txt}R-squared       ={res}    0.0092
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0770
{txt}       Total {c |} {res} 25.8798714        25  1.03519486   {txt}Root MSE        =   {res} 1.0559

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 8}L2D. {c |}{col 14}{res}{space 2}-.0805558{col 26}{space 2} .2299203{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-.5561822{col 67}{space 3} .3950705
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .0218562{col 26}{space 2} .2238511{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4} -.441215{col 67}{space 3} .4849274
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0832065{col 26}{space 2} .2102705{col 37}{space 1}    0.40{col 46}{space 3}0.696{col 54}{space 4}-.3517713{col 67}{space 3} .5181842
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}        26{col 28} -36.8322{col 39}-36.71222{col 50}     3{col 58} 79.42445{col 69} 83.19874
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df23=el(r(S),1,4)
{txt}
{com}. scalar define aic23=el(r(S),1,5)
{txt}
{com}. scalar define bic23=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y       l2d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.202326}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.176127}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7737328}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.260123}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  1.24396}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse23=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse23
{txt}   krmse23 = {res} .81011538
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y       l2d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.1743793
{txt}Mean Absolute Errors     {c |}{col 30}{res}.93166705
{txt}Pseudo-R2                {c |} {col 30}{res}.6235484
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse23=r(rmse)
{txt}
{com}. 
. reg d.y l1d.y l2d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        26
{txt}{hline 13}{c +}{hline 34}   F(3, 22)        = {res}     3.31
{txt}       Model {c |} {res} 8.04353552         3  2.68117851   {txt}Prob > F        ={res}    0.0390
{txt}    Residual {c |} {res} 17.8363359        22   .81074254   {txt}R-squared       ={res}    0.3108
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2168
{txt}       Total {c |} {res} 25.8798714        25  1.03519486   {txt}Root MSE        =   {res} .90041

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.6480901{col 26}{space 2} .2088663{col 37}{space 1}   -3.10{col 46}{space 3}0.005{col 54}{space 4}-1.081252{col 67}{space 3}-.2149279
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.4593609{col 26}{space 2} .2309682{col 37}{space 1}   -1.99{col 46}{space 3}0.059{col 54}{space 4}-.9383596{col 67}{space 3} .0196377
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.1948192{col 26}{space 2} .2032633{col 37}{space 1}   -0.96{col 46}{space 3}0.348{col 54}{space 4}-.6163615{col 67}{space 3}  .226723
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}   .18366{col 26}{space 2}   .18221{col 37}{space 1}    1.01{col 46}{space 3}0.324{col 54}{space 4}-.1942205{col 67}{space 3} .5615405
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}        26{col 28} -36.8322{col 39}-31.99324{col 50}     4{col 58} 71.98647{col 69} 77.01886
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df123=el(r(S),1,4)
{txt}
{com}. scalar define aic123=el(r(S),1,5)
{txt}
{com}. scalar define bic123=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l1d.y l2d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.277871}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .4126419}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.187153}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7160594}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .7569776}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse123=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse123
{txt}  krmse123 = {res} .65561544
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l1d.y l2d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.0025941
{txt}Mean Absolute Errors     {c |}{col 30}{res}.78300616
{txt}Pseudo-R2                {c |} {col 30}{res}.14309964
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse123=r(rmse)
{txt}
{com}. 
. matrix drop _all
{txt}
{com}. matrix fit1=(df1,aic1,bic1,krmse1,loormse1)
{txt}
{com}. matrix fit2=(df2,aic2,bic2,krmse2,loormse2)
{txt}
{com}. matrix fit3=(df3,aic3,bic3,krmse3,loormse3)
{txt}
{com}. matrix fit12=(df12,aic12,bic12,krmse12,loormse12)
{txt}
{com}. matrix fit13=(df13,aic13,bic13,krmse13,loormse13)
{txt}
{com}. matrix fit23=(df23,aic23,bic23,krmse23,loormse23)
{txt}
{com}. matrix fit123=(df123,aic123,bic123,krmse123,loormse123)
{txt}
{com}. matrix FIT=fit1\fit2\fit3\fit12\fit13\fit23\fit123
{txt}
{com}. matrix rownames FIT="Model 1" "Model 2" "Model 3" "Model 12" "Model 13" "Model 23" "Model 123"
{txt}
{com}. matrix colnames FIT=df AIC BIC K(10)RMSE LOORMSE
{txt}
{com}. matrix list FIT
{res}
{txt}FIT[7,5]
                  df        AIC        BIC  K(10)RMSE    LOORMSE
  Model 1 {res}         2  75.880218  78.544627  .63419929  .95384454
{txt}  Model 2 {res}         2  79.409433  82.001106  .77704956   1.110311
{txt}  Model 3 {res}         2  77.562845  80.079038  .72400711  1.1233063
{txt} Model 12 {res}         3  72.555413  76.442924  .62646722  .97005343
{txt} Model 13 {res}         3  74.285365  78.059655  .68570296  1.0320119
{txt} Model 23 {res}         3  79.424447  83.198737  .81011538  1.1743793
{txt}Model 123 {res}         4  71.986474  77.018861  .65561544  1.0025941
{reset}
{com}. 
. *1b
. clear
{txt}
{com}. set obs 300
{txt}{p}
number of observations (_N)  was 0,
now 300
{p_end}

{com}. gen t=[_n]
{txt}
{com}. tsset t
{res}{txt}{col 9}time variable:  {res}{col 25}t, 1 to 300
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen r=rnormal()
{txt}
{com}. gen y=r if t<4
{txt}(297 missing values generated)

{com}. replace y=0.5+0.5*l.y-0.1*l2.y+0.25*l3.y+r if t>=4 
{txt}(297 real changes made)

{com}. drop r
{txt}
{com}. 
. *model
. reg d.y l1d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       298
{txt}{hline 13}{c +}{hline 34}   F(1, 296)       = {res}    30.29
{txt}       Model {c |} {res} 40.2287435         1  40.2287435   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  393.11806       296  1.32810155   {txt}R-squared       ={res}    0.0928
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0898
{txt}       Total {c |} {res} 433.346804       297  1.45908015   {txt}Root MSE        =   {res} 1.1524

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.3047742{col 26}{space 2} .0553765{col 37}{space 1}   -5.50{col 46}{space 3}0.000{col 54}{space 4}-.4137557{col 67}{space 3}-.1957926
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0055929{col 26}{space 2} .0667596{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}-.1257907{col 67}{space 3} .1369765
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *aic/bic
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       298{col 28} -478.636{col 39}-464.1191{col 50}     2{col 58} 932.2383{col 69} 939.6325
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df1=el(r(S),1,4)
{txt}
{com}. scalar define aic1=el(r(S),1,5)
{txt}
{com}. scalar define bic1=el(r(S),1,6)
{txt}
{com}. *10 fold cv rmse
. crossfold reg d.y l1d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.070865}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.307489}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.076643}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.144266}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.153222}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse1=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse1
{txt}    krmse1 = {res} .81576385
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. *loocv
. loocv reg d.y l1d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.1602627
{txt}Mean Absolute Errors     {c |}{col 30}{res}.9370285
{txt}Pseudo-R2                {c |} {col 30}{res}.08032407
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse1=r(rmse)
{txt}
{com}. 
. reg d.y l2d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       297
{txt}{hline 13}{c +}{hline 34}   F(1, 295)       = {res}    28.21
{txt}       Model {c |} {res} 37.8014875         1  37.8014875   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 395.272758       295  1.33990765   {txt}R-squared       ={res}    0.0873
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0842
{txt}       Total {c |} {res} 433.074246       296  1.46308867   {txt}Root MSE        =   {res} 1.1575

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 8}L2D. {c |}{col 14}{res}{space 2}-.2956623{col 26}{space 2} .0556646{col 37}{space 1}   -5.31{col 46}{space 3}0.000{col 54}{space 4}-.4052123{col 67}{space 3}-.1861123
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0080967{col 26}{space 2} .0671695{col 37}{space 1}    0.12{col 46}{space 3}0.904{col 54}{space 4}-.1240954{col 67}{space 3} .1402888
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       297{col 28}-477.4355{col 39}-463.8726{col 50}     2{col 58} 931.7451{col 69} 939.1326
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df2=el(r(S),1,4)
{txt}
{com}. scalar define aic2=el(r(S),1,5)
{txt}
{com}. scalar define bic2=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l2d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.155929}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.318321}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.105786}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.208012}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.006752}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse2=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse2
{txt}    krmse2 = {res} .82278473
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l2d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.164344
{txt}Mean Absolute Errors     {c |}{col 30}{res}.96184136
{txt}Pseudo-R2                {c |} {col 30}{res}.07534286
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse2=r(rmse)
{txt}
{com}. 
. reg d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       296
{txt}{hline 13}{c +}{hline 34}   F(1, 294)       = {res}    14.20
{txt}       Model {c |} {res} 19.9598466         1  19.9598466   {txt}Prob > F        ={res}    0.0002
{txt}    Residual {c |} {res} 413.112855       294  1.40514577   {txt}R-squared       ={res}    0.0461
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0428
{txt}       Total {c |} {res} 433.072702       295  1.46804306   {txt}Root MSE        =   {res} 1.1854

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 8}L3D. {c |}{col 14}{res}{space 2}  .214962{col 26}{space 2} .0570353{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} .1027128{col 67}{space 3} .3272113
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0037681{col 26}{space 2} .0689004{col 37}{space 1}    0.05{col 46}{space 3}0.956{col 54}{space 4}-.1318325{col 67}{space 3} .1393686
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       296{col 28}-476.3266{col 39}-469.3433{col 50}     2{col 58} 942.6866{col 69} 950.0673
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df3=el(r(S),1,4)
{txt}
{com}. scalar define aic3=el(r(S),1,5)
{txt}
{com}. scalar define bic3=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.220885}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.300472}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.206425}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.047378}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.156072}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse3=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse3
{txt}    krmse3 = {res} .84087751
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.1927634
{txt}Mean Absolute Errors     {c |}{col 30}{res}.97432674
{txt}Pseudo-R2                {c |} {col 30}{res}.03508471
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse3=r(rmse)
{txt}
{com}. 
. reg d.y l1d.y l2d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       297
{txt}{hline 13}{c +}{hline 34}   F(2, 294)       = {res}    51.48
{txt}       Model {c |} {res}  112.32631         2   56.163155   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 320.747936       294  1.09097937   {txt}R-squared       ={res}    0.2594
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2543
{txt}       Total {c |} {res} 433.074246       296  1.46308867   {txt}Root MSE        =   {res} 1.0445

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.4357756{col 26}{space 2} .0527255{col 37}{space 1}   -8.26{col 46}{space 3}0.000{col 54}{space 4}-.5395429{col 67}{space 3}-.3320084
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.4291487{col 26}{space 2} .0527612{col 37}{space 1}   -8.13{col 46}{space 3}0.000{col 54}{space 4}-.5329862{col 67}{space 3}-.3253111
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0117439{col 26}{space 2} .0606114{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-.1075433{col 67}{space 3} .1310311
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       297{col 28}-477.4355{col 39}-432.8479{col 50}     3{col 58} 871.6957{col 69} 882.7769
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df12=el(r(S),1,4)
{txt}
{com}. scalar define aic12=el(r(S),1,5)
{txt}
{com}. scalar define bic12=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l1d.y l2d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .9054228}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .9939704}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.153992}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.044548}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.095283}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse12=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse12
{txt}   krmse12 = {res} .73689822
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l1d.y l2d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.0505398
{txt}Mean Absolute Errors     {c |}{col 30}{res}.8495225
{txt}Pseudo-R2                {c |} {col 30}{res}.2471428
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse12=r(rmse)
{txt}
{com}. 
. reg d.y l1d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       296
{txt}{hline 13}{c +}{hline 34}   F(2, 293)       = {res}    18.07
{txt}       Model {c |} {res} 47.5617458         2  23.7808729   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 385.510956       293  1.31573705   {txt}R-squared       ={res}    0.1098
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1037
{txt}       Total {c |} {res} 433.072702       295  1.46804306   {txt}Root MSE        =   {res} 1.1471

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.2642997{col 26}{space 2} .0577048{col 37}{space 1}   -4.58{col 46}{space 3}0.000{col 54}{space 4}-.3778681{col 67}{space 3}-.1507313
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .1369759{col 26}{space 2} .0577577{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} .0233034{col 67}{space 3} .2506484
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0062375{col 26}{space 2} .0666745{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-.1249842{col 67}{space 3} .1374591
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       296{col 28}-476.3266{col 39}-459.1089{col 50}     3{col 58} 924.2178{col 69} 935.2889
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df13=el(r(S),1,4)
{txt}
{com}. scalar define aic13=el(r(S),1,5)
{txt}
{com}. scalar define bic13=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l1d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.144654}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.043574}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.244819}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  1.14139}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.214143}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse13=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse13
{txt}   krmse13 = {res} .82010777
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l1d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.1555101
{txt}Mean Absolute Errors     {c |}{col 30}{res}.9348069
{txt}Pseudo-R2                {c |} {col 30}{res}.09434506
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse13=r(rmse)
{txt}
{com}. 
. reg d.y       l2d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       296
{txt}{hline 13}{c +}{hline 34}   F(2, 293)       = {res}    17.08
{txt}       Model {c |} {res}  45.215903         2  22.6079515   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 387.856799       293  1.32374334   {txt}R-squared       ={res}    0.1044
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0983
{txt}       Total {c |} {res} 433.072702       295  1.46804306   {txt}Root MSE        =   {res} 1.1505

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 8}L2D. {c |}{col 14}{res}{space 2}-.2538017{col 26}{space 2}  .058105{col 37}{space 1}   -4.37{col 46}{space 3}0.000{col 54}{space 4}-.3681577{col 67}{space 3}-.1394456
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .1374621{col 26}{space 2} .0581324{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4}  .023052{col 67}{space 3} .2518721
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0064038{col 26}{space 2} .0668776{col 37}{space 1}    0.10{col 46}{space 3}0.924{col 54}{space 4}-.1252176{col 67}{space 3} .1380252
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       296{col 28}-476.3266{col 39}-460.0068{col 50}     3{col 58} 926.0135{col 69} 937.0846
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df23=el(r(S),1,4)
{txt}
{com}. scalar define aic23=el(r(S),1,5)
{txt}
{com}. scalar define bic23=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y       l2d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.261762}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.151197}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.047751}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.195764}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.0922}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse23=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse23
{txt}   krmse23 = {res} .81472913
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y       l2d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.1606538
{txt}Mean Absolute Errors     {c |}{col 30}{res}.94993411
{txt}Pseudo-R2                {c |} {col 30}{res}.08627031
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse23=r(rmse)
{txt}
{com}. 
. reg d.y l1d.y l2d.y l3d.y

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       296
{txt}{hline 13}{c +}{hline 34}   F(3, 292)       = {res}    34.57
{txt}       Model {c |} {res} 113.494499         3  37.8314998   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 319.578203       292   1.0944459   {txt}R-squared       ={res}    0.2621
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2545
{txt}       Total {c |} {res} 433.072702       295  1.46804306   {txt}Root MSE        =   {res} 1.0462

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         D.y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}y {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.4616699{col 26}{space 2} .0584503{col 37}{space 1}   -7.90{col 46}{space 3}0.000{col 54}{space 4}-.5767071{col 67}{space 3}-.3466327
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.4554328{col 26}{space 2} .0586774{col 37}{space 1}   -7.76{col 46}{space 3}0.000{col 54}{space 4}-.5709171{col 67}{space 3}-.3399486
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0603309{col 26}{space 2} .0584902{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-.1754466{col 67}{space 3} .0547848
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0128112{col 26}{space 2} .0608155{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-.1068812{col 67}{space 3} .1325036
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       296{col 28}-476.3266{col 39}-431.3489{col 50}     4{col 58} 870.6978{col 69} 885.4592
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df123=el(r(S),1,4)
{txt}
{com}. scalar define aic123=el(r(S),1,5)
{txt}
{com}. scalar define bic123=el(r(S),1,6)
{txt}
{com}. crossfold reg d.y l1d.y l2d.y l3d.y
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.193648}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .9485697}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.119405}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 1.049818}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .9232315}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse123=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse123
{txt}  krmse123 = {res} .74378241
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.y l1d.y l2d.y l3d.y


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}1.0551773
{txt}Mean Absolute Errors     {c |}{col 30}{res}.85532304
{txt}Pseudo-R2                {c |} {col 30}{res}.24451175
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse123=r(rmse)
{txt}
{com}. 
. matrix drop _all
{txt}
{com}. matrix fit1=(df1,aic1,bic1,krmse1,loormse1)
{txt}
{com}. matrix fit2=(df2,aic2,bic2,krmse2,loormse2)
{txt}
{com}. matrix fit3=(df3,aic3,bic3,krmse3,loormse3)
{txt}
{com}. matrix fit12=(df12,aic12,bic12,krmse12,loormse12)
{txt}
{com}. matrix fit13=(df13,aic13,bic13,krmse13,loormse13)
{txt}
{com}. matrix fit23=(df23,aic23,bic23,krmse23,loormse23)
{txt}
{com}. matrix fit123=(df123,aic123,bic123,krmse123,loormse123)
{txt}
{com}. matrix FIT=fit1\fit2\fit3\fit12\fit13\fit23\fit123
{txt}
{com}. matrix rownames FIT="Model 1" "Model 2" "Model 3" "Model 12" "Model 13" "Model 23" "Model 123"
{txt}
{com}. matrix colnames FIT=df AIC BIC K(10)RMSE LOORMSE
{txt}
{com}. matrix list FIT
{res}
{txt}FIT[7,5]
                  df        AIC        BIC  K(10)RMSE    LOORMSE
  Model 1 {res}         2  932.23828  939.63247  .81576385  1.1602627
{txt}  Model 2 {res}         2  931.74513   939.1326  .82278473   1.164344
{txt}  Model 3 {res}         2  942.68657  950.06729  .84087751  1.1927634
{txt} Model 12 {res}         3  871.69575  882.77694  .73689822  1.0505398
{txt} Model 13 {res}         3  924.21782   935.2889  .82010777  1.1555101
{txt} Model 23 {res}         3  926.01353  937.08461  .81472913  1.1606538
{txt}Model 123 {res}         4  870.69781  885.45925  .74378241  1.0551773
{reset}
{com}. 
. *2
. clear
{txt}
{com}. cd "/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 3"
{res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 3
{txt}
{com}. import delimited "Assignment_1_Monthly.txt"
{res}{text}(5 vars, 984 obs)

{com}. 
. rename lnu02300000 us_epr
{res}{txt}
{com}. rename flnan fl_nonfarm
{res}{txt}
{com}. rename fllfn fl_lf
{res}{txt}
{com}. rename flbppriv fl_bp
{res}{txt}
{com}. rename date datestring
{res}{txt}
{com}. 
. *2d Generate a monthly date variable (make its display format monthly time, %tm)
. gen datec=date(datestring, "YMD")
{txt}
{com}. gen date=mofd(datec)
{txt}
{com}. format date %tm
{txt}
{com}. 
. *2e tsset your data
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1939m1 to 2020m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. gen month=month(datec)
{txt}
{com}. 
. *2f
. gen lnusepr=log(us_epr)
{txt}(108 missing values generated)

{com}. gen lnflnonfarm=log(fl_nonfarm)
{txt}
{com}. gen lnfllf=log(fl_lf)
{txt}(444 missing values generated)

{com}. gen lnflbp=log(fl_bp)
{txt}(588 missing values generated)

{com}. 
. *model
. reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/12)d.lnfllf l(0/12)d.lnusepr l(0/12)d.lnflbp i.month date

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       383
{txt}{hline 13}{c +}{hline 34}   F(63, 319)      = {res}    53.24
{txt}       Model {c |} {res} .050768432        63  .000805848   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .004828206       319  .000015135   {txt}R-squared       ={res}    0.9132
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8960
{txt}       Total {c |} {res} .055596638       382  .000145541   {txt}Root MSE        =   {res} .00389

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.          {col 14}{c |}
{col 1} lnflnonfarm{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}lnflnonfarm {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.3187209{col 26}{space 2} .0520581{col 37}{space 1}   -6.12{col 46}{space 3}0.000{col 54}{space 4}-.4211416{col 67}{space 3}-.2163003
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1993953{col 26}{space 2} .0546776{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4}-.3069696{col 67}{space 3} -.091821
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}  .004615{col 26}{space 2} .0556328{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-.1048386{col 67}{space 3} .1140686
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2} .0520114{col 26}{space 2} .0553102{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-.0568075{col 67}{space 3} .1608302
{txt}{space 8}L5D. {c |}{col 14}{res}{space 2}-.0290364{col 26}{space 2} .0550957{col 37}{space 1}   -0.53{col 46}{space 3}0.599{col 54}{space 4}-.1374333{col 67}{space 3} .0793605
{txt}{space 8}L6D. {c |}{col 14}{res}{space 2}-.0411661{col 26}{space 2} .0575557{col 37}{space 1}   -0.72{col 46}{space 3}0.475{col 54}{space 4}-.1544029{col 67}{space 3} .0720706
{txt}{space 8}L7D. {c |}{col 14}{res}{space 2}-.0589717{col 26}{space 2} .0560994{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-.1693433{col 67}{space 3}    .0514
{txt}{space 8}L8D. {c |}{col 14}{res}{space 2}  -.06692{col 26}{space 2} .0555654{col 37}{space 1}   -1.20{col 46}{space 3}0.229{col 54}{space 4}-.1762409{col 67}{space 3}  .042401
{txt}{space 8}L9D. {c |}{col 14}{res}{space 2} .0735794{col 26}{space 2} .0592884{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.0430663{col 67}{space 3}  .190225
{txt}{space 7}L10D. {c |}{col 14}{res}{space 2}-.1280257{col 26}{space 2} .0580919{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.2423174{col 67}{space 3} -.013734
{txt}{space 7}L11D. {c |}{col 14}{res}{space 2}-.0562037{col 26}{space 2} .0581423{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-.1705946{col 67}{space 3} .0581872
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2} .4026367{col 26}{space 2} .0587393{col 37}{space 1}    6.85{col 46}{space 3}0.000{col 54}{space 4} .2870713{col 67}{space 3} .5182021
{txt}{space 12} {c |}
{space 6}lnfllf {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.4678501{col 26}{space 2}  .091836{col 37}{space 1}   -5.09{col 46}{space 3}0.000{col 54}{space 4}-.6485309{col 67}{space 3}-.2871693
{txt}{space 9}LD. {c |}{col 14}{res}{space 2}-.1874345{col 26}{space 2} .0955731{col 37}{space 1}   -1.96{col 46}{space 3}0.051{col 54}{space 4}-.3754677{col 67}{space 3} .0005987
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1532159{col 26}{space 2} .0957994{col 37}{space 1}   -1.60{col 46}{space 3}0.111{col 54}{space 4}-.3416944{col 67}{space 3} .0352626
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}  .186449{col 26}{space 2} .0979739{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-.0063077{col 67}{space 3} .3792057
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2} .0760726{col 26}{space 2} .0990118{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4} -.118726{col 67}{space 3} .2708713
{txt}{space 8}L5D. {c |}{col 14}{res}{space 2} .0351072{col 26}{space 2}  .099036{col 37}{space 1}    0.35{col 46}{space 3}0.723{col 54}{space 4}-.1597391{col 67}{space 3} .2299535
{txt}{space 8}L6D. {c |}{col 14}{res}{space 2} .0231131{col 26}{space 2} .0990097{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-.1716814{col 67}{space 3} .2179075
{txt}{space 8}L7D. {c |}{col 14}{res}{space 2} .1259544{col 26}{space 2} .0974149{col 37}{space 1}    1.29{col 46}{space 3}0.197{col 54}{space 4}-.0657025{col 67}{space 3} .3176112
{txt}{space 8}L8D. {c |}{col 14}{res}{space 2}  .024699{col 26}{space 2} .0982434{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-.1685878{col 67}{space 3} .2179858
{txt}{space 8}L9D. {c |}{col 14}{res}{space 2} .1150141{col 26}{space 2} .1100678{col 37}{space 1}    1.04{col 46}{space 3}0.297{col 54}{space 4}-.1015364{col 67}{space 3} .3315646
{txt}{space 7}L10D. {c |}{col 14}{res}{space 2} .2080239{col 26}{space 2} .1108839{col 37}{space 1}    1.88{col 46}{space 3}0.062{col 54}{space 4}-.0101322{col 67}{space 3}   .42618
{txt}{space 7}L11D. {c |}{col 14}{res}{space 2}-.0752819{col 26}{space 2} .1117702{col 37}{space 1}   -0.67{col 46}{space 3}0.501{col 54}{space 4}-.2951818{col 67}{space 3} .1446179
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2}-.1248653{col 26}{space 2} .1111426{col 37}{space 1}   -1.12{col 46}{space 3}0.262{col 54}{space 4}-.3435303{col 67}{space 3} .0937998
{txt}{space 12} {c |}
{space 5}lnusepr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} 1.058897{col 26}{space 2} .0618861{col 37}{space 1}   17.11{col 46}{space 3}0.000{col 54}{space 4}  .937141{col 67}{space 3} 1.180654
{txt}{space 9}LD. {c |}{col 14}{res}{space 2}  .376984{col 26}{space 2}  .084734{col 37}{space 1}    4.45{col 46}{space 3}0.000{col 54}{space 4} .2102759{col 67}{space 3} .5436921
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .2272904{col 26}{space 2} .0866516{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} .0568095{col 67}{space 3} .3977713
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.1902081{col 26}{space 2}  .087627{col 37}{space 1}   -2.17{col 46}{space 3}0.031{col 54}{space 4}-.3626078{col 67}{space 3}-.0178083
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2}   .00045{col 26}{space 2} .0885154{col 37}{space 1}    0.01{col 46}{space 3}0.996{col 54}{space 4}-.1736977{col 67}{space 3} .1745976
{txt}{space 8}L5D. {c |}{col 14}{res}{space 2}-.0261134{col 26}{space 2} .0874342{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-.1981339{col 67}{space 3} .1459071
{txt}{space 8}L6D. {c |}{col 14}{res}{space 2} .1609474{col 26}{space 2} .0889456{col 37}{space 1}    1.81{col 46}{space 3}0.071{col 54}{space 4}-.0140467{col 67}{space 3} .3359415
{txt}{space 8}L7D. {c |}{col 14}{res}{space 2} .0157551{col 26}{space 2} .0888144{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.1589808{col 67}{space 3}  .190491
{txt}{space 8}L8D. {c |}{col 14}{res}{space 2} .0633536{col 26}{space 2} .0901157{col 37}{space 1}    0.70{col 46}{space 3}0.483{col 54}{space 4}-.1139427{col 67}{space 3} .2406498
{txt}{space 8}L9D. {c |}{col 14}{res}{space 2} .0217037{col 26}{space 2} .1470597{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-.2676257{col 67}{space 3} .3110332
{txt}{space 7}L10D. {c |}{col 14}{res}{space 2}-.1641384{col 26}{space 2} .1480045{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-.4553266{col 67}{space 3} .1270498
{txt}{space 7}L11D. {c |}{col 14}{res}{space 2} .2149393{col 26}{space 2} .1460384{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0723808{col 67}{space 3} .5022593
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2} .0161647{col 26}{space 2} .1416189{col 37}{space 1}    0.11{col 46}{space 3}0.909{col 54}{space 4}-.2624602{col 67}{space 3} .2947897
{txt}{space 12} {c |}
{space 6}lnflbp {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0043768{col 26}{space 2} .0017545{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4}  .000925{col 67}{space 3} .0078286
{txt}{space 9}LD. {c |}{col 14}{res}{space 2} .0049935{col 26}{space 2} .0020942{col 37}{space 1}    2.38{col 46}{space 3}0.018{col 54}{space 4} .0008732{col 67}{space 3} .0091137
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .0051854{col 26}{space 2} .0022195{col 37}{space 1}    2.34{col 46}{space 3}0.020{col 54}{space 4} .0008187{col 67}{space 3}  .009552
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .0065461{col 26}{space 2} .0022284{col 37}{space 1}    2.94{col 46}{space 3}0.004{col 54}{space 4}  .002162{col 67}{space 3} .0109302
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2} .0055029{col 26}{space 2} .0022297{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4}  .001116{col 67}{space 3} .0098898
{txt}{space 8}L5D. {c |}{col 14}{res}{space 2} .0067131{col 26}{space 2} .0022143{col 37}{space 1}    3.03{col 46}{space 3}0.003{col 54}{space 4} .0023567{col 67}{space 3} .0110696
{txt}{space 8}L6D. {c |}{col 14}{res}{space 2} .0071018{col 26}{space 2} .0022379{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4}  .002699{col 67}{space 3} .0115047
{txt}{space 8}L7D. {c |}{col 14}{res}{space 2}  .007351{col 26}{space 2}  .002247{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} .0029301{col 67}{space 3} .0117719
{txt}{space 8}L8D. {c |}{col 14}{res}{space 2} .0054368{col 26}{space 2} .0023044{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4} .0009031{col 67}{space 3} .0099705
{txt}{space 8}L9D. {c |}{col 14}{res}{space 2}  .004466{col 26}{space 2} .0022983{col 37}{space 1}    1.94{col 46}{space 3}0.053{col 54}{space 4}-.0000558{col 67}{space 3} .0089878
{txt}{space 7}L10D. {c |}{col 14}{res}{space 2} .0061294{col 26}{space 2} .0022689{col 37}{space 1}    2.70{col 46}{space 3}0.007{col 54}{space 4} .0016656{col 67}{space 3} .0105932
{txt}{space 7}L11D. {c |}{col 14}{res}{space 2} .0032694{col 26}{space 2} .0021733{col 37}{space 1}    1.50{col 46}{space 3}0.133{col 54}{space 4}-.0010063{col 67}{space 3} .0075452
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2} .0026534{col 26}{space 2}  .001789{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0008664{col 67}{space 3} .0061731
{txt}{space 12} {c |}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0019614{col 26}{space 2} .0032441{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4}-.0083439{col 67}{space 3} .0044211
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0024974{col 26}{space 2} .0033763{col 37}{space 1}   -0.74{col 46}{space 3}0.460{col 54}{space 4}  -.00914{col 67}{space 3} .0041452
{txt}{space 10}4  {c |}{col 14}{res}{space 2} -.007529{col 26}{space 2} .0038677{col 37}{space 1}   -1.95{col 46}{space 3}0.052{col 54}{space 4}-.0151384{col 67}{space 3} .0000805
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0039676{col 26}{space 2} .0033266{col 37}{space 1}   -1.19{col 46}{space 3}0.234{col 54}{space 4}-.0105125{col 67}{space 3} .0025772
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0144882{col 26}{space 2} .0036057{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4}-.0215823{col 67}{space 3}-.0073942
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0097851{col 26}{space 2} .0032285{col 37}{space 1}   -3.03{col 46}{space 3}0.003{col 54}{space 4} -.016137{col 67}{space 3}-.0034332
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0000542{col 26}{space 2} .0035161{col 37}{space 1}   -0.02{col 46}{space 3}0.988{col 54}{space 4}-.0069719{col 67}{space 3} .0068635
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0051214{col 26}{space 2} .0032399{col 37}{space 1}    1.58{col 46}{space 3}0.115{col 54}{space 4}-.0012529{col 67}{space 3} .0114956
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0025358{col 26}{space 2} .0044185{col 37}{space 1}    0.57{col 46}{space 3}0.566{col 54}{space 4}-.0061572{col 67}{space 3} .0112288
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0004647{col 26}{space 2} .0037668{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.0078757{col 67}{space 3} .0069462
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0024219{col 26}{space 2}  .003508{col 37}{space 1}    0.69{col 46}{space 3}0.490{col 54}{space 4}-.0044799{col 67}{space 3} .0093237
{txt}{space 12} {c |}
{space 8}date {c |}{col 14}{res}{space 2}-5.37e-06{col 26}{space 2} 2.17e-06{col 37}{space 1}   -2.48{col 46}{space 3}0.014{col 54}{space 4}-9.64e-06{col 67}{space 3}-1.11e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0079011{col 26}{space 2} .0030662{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} .0018685{col 67}{space 3} .0139337
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *aic/bic
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       383{col 28}  1148.96{col 39} 1616.918{col 50}    64{col 58}-3105.837{col 69}-2853.163
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df1=el(r(S),1,4)
{txt}
{com}. scalar define aic1=el(r(S),1,5)
{txt}
{com}. scalar define bic1=el(r(S),1,6)
{txt}
{com}. *10 fold cv rmse
. crossfold reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/12)d.lnfllf l(0/12)d.lnusepr l(0/12)d.lnflbp i.month date
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0041889}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0108909}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0039031}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0059736}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0061815}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse1=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse1
{txt}    krmse1 = {res} .00474646
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. *loocv
. loocv reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/12)d.lnfllf l(0/12)d.lnusepr l(0/12)d.lnflbp i.month date


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}.00746943
{txt}Mean Absolute Errors     {c |}{col 30}{res}.00370951
{txt}Pseudo-R2                {c |} {col 30}{res}.62103068
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse1=r(rmse)
{txt}
{com}. 
. reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/2)d.lnfllf l(0/2)d.lnusepr l(0/2)d.lnflbp i.month date

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       393
{txt}{hline 13}{c +}{hline 34}   F(33, 359)      = {res}    89.36
{txt}       Model {c |} {res} .050628703        33  .001534203   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .006163276       359  .000017168   {txt}R-squared       ={res}    0.8915
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8815
{txt}       Total {c |} {res} .056791979       392  .000144877   {txt}Root MSE        =   {res} .00414

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.          {col 14}{c |}
{col 1} lnflnonfarm{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}lnflnonfarm {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.2879019{col 26}{space 2} .0460794{col 37}{space 1}   -6.25{col 46}{space 3}0.000{col 54}{space 4}-.3785214{col 67}{space 3}-.1972825
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1514457{col 26}{space 2} .0463813{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4} -.242659{col 67}{space 3}-.0602325
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0567902{col 26}{space 2} .0294329{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-.1146727{col 67}{space 3} .0010924
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2} .0805401{col 26}{space 2}  .029035{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .0234401{col 67}{space 3} .1376402
{txt}{space 8}L5D. {c |}{col 14}{res}{space 2} .0148106{col 26}{space 2} .0285969{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-.0414279{col 67}{space 3} .0710492
{txt}{space 8}L6D. {c |}{col 14}{res}{space 2} .1156142{col 26}{space 2} .0294928{col 37}{space 1}    3.92{col 46}{space 3}0.000{col 54}{space 4} .0576138{col 67}{space 3} .1736146
{txt}{space 8}L7D. {c |}{col 14}{res}{space 2} .0569047{col 26}{space 2} .0295656{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4} -.001239{col 67}{space 3} .1150483
{txt}{space 8}L8D. {c |}{col 14}{res}{space 2} .0333213{col 26}{space 2} .0299318{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.0255424{col 67}{space 3}  .092185
{txt}{space 8}L9D. {c |}{col 14}{res}{space 2} .0904818{col 26}{space 2} .0496354{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0071309{col 67}{space 3} .1880945
{txt}{space 7}L10D. {c |}{col 14}{res}{space 2}-.0920517{col 26}{space 2} .0486864{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.1877981{col 67}{space 3} .0036947
{txt}{space 7}L11D. {c |}{col 14}{res}{space 2} -.041793{col 26}{space 2} .0502562{col 37}{space 1}   -0.83{col 46}{space 3}0.406{col 54}{space 4}-.1406266{col 67}{space 3} .0570406
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2} .5067995{col 26}{space 2} .0521856{col 37}{space 1}    9.71{col 46}{space 3}0.000{col 54}{space 4} .4041716{col 67}{space 3} .6094273
{txt}{space 12} {c |}
{space 6}lnfllf {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.5263049{col 26}{space 2}  .089119{col 37}{space 1}   -5.91{col 46}{space 3}0.000{col 54}{space 4}-.7015658{col 67}{space 3}-.3510439
{txt}{space 9}LD. {c |}{col 14}{res}{space 2}-.2330839{col 26}{space 2} .0937837{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-.4175183{col 67}{space 3}-.0486495
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1589497{col 26}{space 2} .0933952{col 37}{space 1}   -1.70{col 46}{space 3}0.090{col 54}{space 4}-.3426201{col 67}{space 3} .0247208
{txt}{space 12} {c |}
{space 5}lnusepr {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} 1.060432{col 26}{space 2} .0618714{col 37}{space 1}   17.14{col 46}{space 3}0.000{col 54}{space 4} .9387559{col 67}{space 3} 1.182108
{txt}{space 9}LD. {c |}{col 14}{res}{space 2} .3727363{col 26}{space 2} .0796402{col 37}{space 1}    4.68{col 46}{space 3}0.000{col 54}{space 4} .2161164{col 67}{space 3} .5293561
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}   .18183{col 26}{space 2} .0794706{col 37}{space 1}    2.29{col 46}{space 3}0.023{col 54}{space 4} .0255436{col 67}{space 3} .3381164
{txt}{space 12} {c |}
{space 6}lnflbp {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0039846{col 26}{space 2} .0017113{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} .0006191{col 67}{space 3}   .00735
{txt}{space 9}LD. {c |}{col 14}{res}{space 2}  .002868{col 26}{space 2} .0019597{col 37}{space 1}    1.46{col 46}{space 3}0.144{col 54}{space 4} -.000986{col 67}{space 3}  .006722
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .0007752{col 26}{space 2} .0017454{col 37}{space 1}    0.44{col 46}{space 3}0.657{col 54}{space 4}-.0026574{col 67}{space 3} .0042078
{txt}{space 12} {c |}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0067672{col 26}{space 2} .0019876{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.0106759{col 67}{space 3}-.0028585
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0075077{col 26}{space 2} .0021433{col 37}{space 1}   -3.50{col 46}{space 3}0.001{col 54}{space 4}-.0117227{col 67}{space 3}-.0032928
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0145828{col 26}{space 2} .0023379{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.0191805{col 67}{space 3}-.0099851
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0115104{col 26}{space 2} .0023047{col 37}{space 1}   -4.99{col 46}{space 3}0.000{col 54}{space 4}-.0160428{col 67}{space 3}-.0069781
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0201266{col 26}{space 2} .0021525{col 37}{space 1}   -9.35{col 46}{space 3}0.000{col 54}{space 4}-.0243597{col 67}{space 3}-.0158934
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0165043{col 26}{space 2} .0020312{col 37}{space 1}   -8.13{col 46}{space 3}0.000{col 54}{space 4}-.0204989{col 67}{space 3}-.0125097
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0060822{col 26}{space 2} .0023503{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4}-.0107044{col 67}{space 3}  -.00146
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0003452{col 26}{space 2} .0020707{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-.0044175{col 67}{space 3} .0037271
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0031356{col 26}{space 2} .0022726{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4} -.007605{col 67}{space 3} .0013337
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0021778{col 26}{space 2} .0022087{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-.0065215{col 67}{space 3} .0021659
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0005171{col 26}{space 2} .0019811{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.0044131{col 67}{space 3} .0033788
{txt}{space 12} {c |}
{space 8}date {c |}{col 14}{res}{space 2}-3.85e-06{col 26}{space 2} 1.97e-06{col 37}{space 1}   -1.95{col 46}{space 3}0.052{col 54}{space 4}-7.73e-06{col 67}{space 3} 2.76e-08
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0119425{col 26}{space 2} .0019422{col 37}{space 1}    6.15{col 46}{space 3}0.000{col 54}{space 4}  .008123{col 67}{space 3}  .015762
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       393{col 28} 1179.844{col 39} 1616.228{col 50}    34{col 58}-3164.456{col 69}-3029.347
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df2=el(r(S),1,4)
{txt}
{com}. scalar define aic2=el(r(S),1,5)
{txt}
{com}. scalar define bic2=el(r(S),1,6)
{txt}
{com}. crossfold reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/2)d.lnfllf l(0/2)d.lnusepr l(0/2)d.lnflbp i.month date
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0083028}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0107218}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0037125}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0057848}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0054343}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse2=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse2
{txt}    krmse2 = {res}  .0051056
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/2)d.lnfllf l(0/2)d.lnusepr l(0/2)d.lnflbp i.month date


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}.00634841
{txt}Mean Absolute Errors     {c |}{col 30}{res}.00352834
{txt}Pseudo-R2                {c |} {col 30}{res}.7235841
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse2=r(rmse)
{txt}
{com}. 
. reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/2,12)d.lnfllf l(0/2,12)d.lnflbp i.month date

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       383
{txt}{hline 13}{c +}{hline 34}   F(32, 350)      = {res}    47.62
{txt}       Model {c |} {res} .045212283        32  .001412884   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .010384356       350   .00002967   {txt}R-squared       ={res}    0.8132
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7961
{txt}       Total {c |} {res} .055596638       382  .000145541   {txt}Root MSE        =   {res} .00545

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.          {col 14}{c |}
{col 1} lnflnonfarm{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}lnflnonfarm {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.1740883{col 26}{space 2} .0474513{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 54}{space 4}-.2674139{col 67}{space 3}-.0807628
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1796728{col 26}{space 2} .0482708{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.2746102{col 67}{space 3}-.0847355
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .0482014{col 26}{space 2}  .037623{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.0257942{col 67}{space 3}  .122197
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2} .0632059{col 26}{space 2} .0373781{col 37}{space 1}    1.69{col 46}{space 3}0.092{col 54}{space 4}-.0103081{col 67}{space 3} .1367199
{txt}{space 8}L5D. {c |}{col 14}{res}{space 2}-.0028745{col 26}{space 2} .0368744{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4}-.0753979{col 67}{space 3} .0696488
{txt}{space 8}L6D. {c |}{col 14}{res}{space 2}-.0245775{col 26}{space 2} .0368577{col 37}{space 1}   -0.67{col 46}{space 3}0.505{col 54}{space 4} -.097068{col 67}{space 3} .0479131
{txt}{space 8}L7D. {c |}{col 14}{res}{space 2} .0020704{col 26}{space 2} .0365831{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-.0698801{col 67}{space 3} .0740208
{txt}{space 8}L8D. {c |}{col 14}{res}{space 2}-.0138142{col 26}{space 2} .0369521{col 37}{space 1}   -0.37{col 46}{space 3}0.709{col 54}{space 4}-.0864904{col 67}{space 3}  .058862
{txt}{space 8}L9D. {c |}{col 14}{res}{space 2} .0905825{col 26}{space 2} .0658306{col 37}{space 1}    1.38{col 46}{space 3}0.170{col 54}{space 4}-.0388908{col 67}{space 3} .2200557
{txt}{space 7}L10D. {c |}{col 14}{res}{space 2} .0013538{col 26}{space 2} .0624801{col 37}{space 1}    0.02{col 46}{space 3}0.983{col 54}{space 4}-.1215299{col 67}{space 3} .1242374
{txt}{space 7}L11D. {c |}{col 14}{res}{space 2} .0933649{col 26}{space 2} .0634182{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0313638{col 67}{space 3} .2180935
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2} .5476684{col 26}{space 2} .0667124{col 37}{space 1}    8.21{col 46}{space 3}0.000{col 54}{space 4} .4164608{col 67}{space 3}  .678876
{txt}{space 12} {c |}
{space 6}lnfllf {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}  .928238{col 26}{space 2} .0488357{col 37}{space 1}   19.01{col 46}{space 3}0.000{col 54}{space 4} .8321896{col 67}{space 3} 1.024286
{txt}{space 9}LD. {c |}{col 14}{res}{space 2} .2156929{col 26}{space 2} .0625792{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4} .0926143{col 67}{space 3} .3387715
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} -.031619{col 26}{space 2} .0633368{col 37}{space 1}   -0.50{col 46}{space 3}0.618{col 54}{space 4}-.1561876{col 67}{space 3} .0929497
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2}-.3699158{col 26}{space 2} .0765149{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4}-.5204027{col 67}{space 3} -.219429
{txt}{space 12} {c |}
{space 6}lnflbp {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0063989{col 26}{space 2} .0022569{col 37}{space 1}    2.84{col 46}{space 3}0.005{col 54}{space 4} .0019601{col 67}{space 3} .0108378
{txt}{space 9}LD. {c |}{col 14}{res}{space 2} .0023471{col 26}{space 2} .0025799{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-.0027269{col 67}{space 3} .0074211
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .0019136{col 26}{space 2} .0023019{col 37}{space 1}    0.83{col 46}{space 3}0.406{col 54}{space 4}-.0026138{col 67}{space 3} .0064409
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2}-.0005871{col 26}{space 2} .0019573{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-.0044366{col 67}{space 3} .0032625
{txt}{space 12} {c |}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0038169{col 26}{space 2} .0025894{col 37}{space 1}    1.47{col 46}{space 3}0.141{col 54}{space 4}-.0012758{col 67}{space 3} .0089095
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0021932{col 26}{space 2}  .002851{col 37}{space 1}    0.77{col 46}{space 3}0.442{col 54}{space 4}-.0034141{col 67}{space 3} .0078005
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0060381{col 26}{space 2} .0027741{col 37}{space 1}    2.18{col 46}{space 3}0.030{col 54}{space 4}  .000582{col 67}{space 3} .0114941
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0021218{col 26}{space 2} .0028366{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4}-.0034572{col 67}{space 3} .0077007
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0044018{col 26}{space 2} .0025573{col 37}{space 1}   -1.72{col 46}{space 3}0.086{col 54}{space 4}-.0094314{col 67}{space 3} .0006277
{txt}{space 10}7  {c |}{col 14}{res}{space 2} -.007066{col 26}{space 2} .0025453{col 37}{space 1}   -2.78{col 46}{space 3}0.006{col 54}{space 4}-.0120719{col 67}{space 3}  -.00206
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0048701{col 26}{space 2} .0029279{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0008884{col 67}{space 3} .0106287
{txt}{space 10}9  {c |}{col 14}{res}{space 2}  .006203{col 26}{space 2}  .002778{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0007394{col 67}{space 3} .0116666
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0122795{col 26}{space 2} .0027643{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} .0068429{col 67}{space 3} .0177162
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0128943{col 26}{space 2} .0026646{col 37}{space 1}    4.84{col 46}{space 3}0.000{col 54}{space 4} .0076537{col 67}{space 3} .0181349
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0111956{col 26}{space 2} .0024931{col 37}{space 1}    4.49{col 46}{space 3}0.000{col 54}{space 4} .0062924{col 67}{space 3} .0160989
{txt}{space 12} {c |}
{space 8}date {c |}{col 14}{res}{space 2}-8.62e-08{col 26}{space 2} 2.63e-06{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-5.27e-06{col 67}{space 3} 5.09e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0044995{col 26}{space 2} .0022885{col 37}{space 1}   -1.97{col 46}{space 3}0.050{col 54}{space 4}-.0090005{col 67}{space 3} 1.56e-06
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       383{col 28}  1148.96{col 39} 1470.263{col 50}    33{col 58}-2874.526{col 69}-2744.241
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df3=el(r(S),1,4)
{txt}
{com}. scalar define aic3=el(r(S),1,5)
{txt}
{com}. scalar define bic3=el(r(S),1,6)
{txt}
{com}. crossfold reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/2,12)d.lnfllf l(0/2,12)d.lnflbp i.month date
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0049165}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0059758}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0057349}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0069113}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0156106}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse3=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse3
{txt}    krmse3 = {res} .00619861
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.lnflnonfarm l(1/12)d.lnflnonfarm l(0/2,12)d.lnfllf l(0/2,12)d.lnflbp i.month date


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}.00808926
{txt}Mean Absolute Errors     {c |}{col 30}{res}.00433674
{txt}Pseudo-R2                {c |} {col 30}{res}.55858806
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse3=r(rmse)
{txt}
{com}. 
. reg d.lnflnonfarm l(1/12,24)d.lnflnonfarm l(1/2,12,24)d.lnfllf l(1/2,12,24)d.lnusepr i.month

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       515
{txt}{hline 13}{c +}{hline 34}   F(32, 482)      = {res}    27.54
{txt}       Model {c |} {res} .043561062        32  .001361283   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .023823343       482  .000049426   {txt}R-squared       ={res}    0.6465
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6230
{txt}       Total {c |} {res} .067384405       514  .000131098   {txt}Root MSE        =   {res} .00703

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.          {col 14}{c |}
{col 1} lnflnonfarm{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}lnflnonfarm {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.0532095{col 26}{space 2} .0602857{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 54}{space 4}-.1716647{col 67}{space 3} .0652456
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0454893{col 26}{space 2} .0610899{col 37}{space 1}   -0.74{col 46}{space 3}0.457{col 54}{space 4}-.1655247{col 67}{space 3}  .074546
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} -.002843{col 26}{space 2} .0435375{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-.0883896{col 67}{space 3} .0827037
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2} .0464336{col 26}{space 2} .0433763{col 37}{space 1}    1.07{col 46}{space 3}0.285{col 54}{space 4}-.0387964{col 67}{space 3} .1316636
{txt}{space 8}L5D. {c |}{col 14}{res}{space 2}-.0013076{col 26}{space 2} .0431507{col 37}{space 1}   -0.03{col 46}{space 3}0.976{col 54}{space 4}-.0860943{col 67}{space 3} .0834792
{txt}{space 8}L6D. {c |}{col 14}{res}{space 2} .0200798{col 26}{space 2} .0443166{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-.0669978{col 67}{space 3} .1071574
{txt}{space 8}L7D. {c |}{col 14}{res}{space 2} .0224034{col 26}{space 2} .0456573{col 37}{space 1}    0.49{col 46}{space 3}0.624{col 54}{space 4}-.0673086{col 67}{space 3} .1121153
{txt}{space 8}L8D. {c |}{col 14}{res}{space 2}-.0328449{col 26}{space 2} .0459038{col 37}{space 1}   -0.72{col 46}{space 3}0.475{col 54}{space 4}-.1230412{col 67}{space 3} .0573514
{txt}{space 8}L9D. {c |}{col 14}{res}{space 2} .0396597{col 26}{space 2}  .069747{col 37}{space 1}    0.57{col 46}{space 3}0.570{col 54}{space 4}-.0973861{col 67}{space 3} .1767054
{txt}{space 7}L10D. {c |}{col 14}{res}{space 2}-.0055183{col 26}{space 2} .0689159{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4} -.140931{col 67}{space 3} .1298945
{txt}{space 7}L11D. {c |}{col 14}{res}{space 2} .0773034{col 26}{space 2} .0698507{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4}-.0599461{col 67}{space 3} .2145529
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2}   .52293{col 26}{space 2} .0889544{col 37}{space 1}    5.88{col 46}{space 3}0.000{col 54}{space 4} .3481438{col 67}{space 3} .6977163
{txt}{space 7}L24D. {c |}{col 14}{res}{space 2} .1727222{col 26}{space 2} .0828627{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0099055{col 67}{space 3} .3355389
{txt}{space 12} {c |}
{space 6}lnfllf {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} .0987675{col 26}{space 2} .1177628{col 37}{space 1}    0.84{col 46}{space 3}0.402{col 54}{space 4}-.1326242{col 67}{space 3} .3301593
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0771596{col 26}{space 2} .1180294{col 37}{space 1}   -0.65{col 46}{space 3}0.514{col 54}{space 4}-.3090752{col 67}{space 3} .1547561
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2}  .037179{col 26}{space 2} .1402792{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 54}{space 4}-.2384553{col 67}{space 3} .3128133
{txt}{space 7}L24D. {c |}{col 14}{res}{space 2} .2524612{col 26}{space 2}   .13061{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0041741{col 67}{space 3} .5090966
{txt}{space 12} {c |}
{space 5}lnusepr {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}  .011417{col 26}{space 2} .1047318{col 37}{space 1}    0.11{col 46}{space 3}0.913{col 54}{space 4}-.1943703{col 67}{space 3} .2172043
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0696112{col 26}{space 2} .1055857{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.2770762{col 67}{space 3} .1378538
{txt}{space 7}L12D. {c |}{col 14}{res}{space 2} .0186543{col 26}{space 2} .1853382{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.3455162{col 67}{space 3} .3828249
{txt}{space 7}L24D. {c |}{col 14}{res}{space 2}-.4320365{col 26}{space 2} .1733143{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-.7725814{col 67}{space 3}-.0914916
{txt}{space 12} {c |}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0101444{col 26}{space 2} .0037078{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0028589{col 67}{space 3}   .01743
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0082944{col 26}{space 2} .0040339{col 37}{space 1}    2.06{col 46}{space 3}0.040{col 54}{space 4} .0003681{col 67}{space 3} .0162207
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0073699{col 26}{space 2} .0043026{col 37}{space 1}    1.71{col 46}{space 3}0.087{col 54}{space 4}-.0010844{col 67}{space 3} .0158242
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0099262{col 26}{space 2} .0038417{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} .0023776{col 67}{space 3} .0174749
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0069505{col 26}{space 2} .0039997{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0009085{col 67}{space 3} .0148094
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0039967{col 26}{space 2} .0035296{col 37}{space 1}    1.13{col 46}{space 3}0.258{col 54}{space 4}-.0029385{col 67}{space 3}  .010932
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0087545{col 26}{space 2} .0035631{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} .0017533{col 67}{space 3} .0157557
{txt}{space 10}9  {c |}{col 14}{res}{space 2}   .00794{col 26}{space 2} .0031884{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .0016752{col 67}{space 3} .0142048
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0129886{col 26}{space 2} .0042968{col 37}{space 1}    3.02{col 46}{space 3}0.003{col 54}{space 4} .0045458{col 67}{space 3} .0214313
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0119932{col 26}{space 2} .0037839{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .0045582{col 67}{space 3} .0194281
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0116251{col 26}{space 2} .0031936{col 37}{space 1}    3.64{col 46}{space 3}0.000{col 54}{space 4}   .00535{col 67}{space 3} .0179002
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0086323{col 26}{space 2} .0031025{col 37}{space 1}   -2.78{col 46}{space 3}0.006{col 54}{space 4}-.0147284{col 67}{space 3}-.0025362
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       515{col 28} 1571.685{col 39}  1839.42{col 50}    33{col 58} -3612.84{col 69}-3472.783
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. scalar define df4=el(r(S),1,4)
{txt}
{com}. scalar define aic4=el(r(S),1,5)
{txt}
{com}. scalar define bic4=el(r(S),1,6)
{txt}
{com}. crossfold reg d.lnflnonfarm l(1/12,24)d.lnflnonfarm l(1/2,12,24)d.lnfllf l(1/2,12,24)d.lnusepr i.month
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:RMSE}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:est1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0041409}}}{space 1}
{space 0}{space 0}{ralign 12:est2}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0152337}}}{space 1}
{space 0}{space 0}{ralign 12:est3}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0066411}}}{space 1}
{space 0}{space 0}{ralign 12:est4}{space 1}{c |}{space 1}{ralign 9:{res:{sf: .0048066}}}{space 1}
{space 0}{space 0}{ralign 12:est5}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  .006126}}}{space 1}

{com}. scalar define k=10
{txt}
{com}. matrix kMSE=r(est)'*r(est)
{txt}
{com}. scalar krmse4=(el(kMSE,1,1)/k)^.5
{txt}
{com}. scalar list krmse4
{txt}    krmse4 = {res} .00594936
{txt}
{com}. matrix drop kMSE
{txt}
{com}. scalar drop k
{txt}
{com}. loocv reg d.lnflnonfarm l(1/12,24)d.lnflnonfarm l(1/2,12,24)d.lnfllf l(1/2,12,24)d.lnusepr i.month


{txt} Leave-One-Out Cross-Validation Results 
{hline 25}{c TT}{hline 15}
         Method          {c |}{col 30} Value
{hline 25}{c +}{hline 15}
Root Mean Squared Errors {c |}{col 30}{res}.01062333
{txt}Mean Absolute Errors     {c |}{col 30}{res}.00394285
{txt}Pseudo-R2                {c |} {col 30}{res}.31761928
{txt}{hline 25}{c BT}{hline 15}

{com}. scalar define loormse4=r(rmse)
{txt}
{com}. 
. matrix drop _all
{txt}
{com}. matrix fit1=(df1,aic1,bic1,krmse1,loormse1)
{txt}
{com}. matrix fit2=(df2,aic2,bic2,krmse2,loormse2)
{txt}
{com}. matrix fit3=(df3,aic3,bic3,krmse3,loormse3)
{txt}
{com}. matrix fit4=(df4,aic4,bic4,krmse4,loormse4)
{txt}
{com}. matrix FIT=fit1\fit2\fit3\fit4
{txt}
{com}. matrix rownames FIT="Model 1" "Model 2" "Model 3" "Model 4"
{txt}
{com}. matrix colnames FIT=df AIC BIC K(10)RMSE LOORMSE
{txt}
{com}. matrix list FIT
{res}
{txt}FIT[4,5]
                 df         AIC         BIC   K(10)RMSE     LOORMSE
Model 1 {res}         64  -3105.8368  -2853.1626   .00474646   .00746943
{txt}Model 2 {res}         34  -3164.4562  -3029.3467    .0051056   .00634841
{txt}Model 3 {res}         33  -2874.5257  -2744.2405   .00619861   .00808926
{txt}Model 4 {res}         33  -3612.8403  -3472.7828   .00594936   .01062333
{reset}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 3/Problem Set 3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Mar 2021, 19:20:04
{txt}{.-}
{smcl}
{txt}{sf}{ul off}