{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 1/Problem Set 1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Feb 2021, 07:25:39
{txt}
{com}. 
. *2d Generate a monthly date variable (make its display format monthly time, %tm)
. gen datec=date(datestring, "YMD")
{txt}
{com}. gen date=mofd(datec)
{txt}
{com}. format date %tm
{txt}
{com}. 
. *2e tsset your data
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1939m1 to 2020m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. *2f
. gen ln_us_epr=log(us_epr)
{txt}(108 missing values generated)

{com}. gen ln_fl_nonfarm=log(fl_nonfarm)
{txt}
{com}. gen ln_fl_lf=log(fl_lf)
{txt}(444 missing values generated)

{com}. gen ln_fl_bp=log(fl_bp)
{txt}(588 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 2/Problem Set 2.do"
{txt}
{com}. clear
{txt}
{com}. set more off
{txt}
{com}. 
. cd "/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 1"
{res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 1
{txt}
{com}. 
. *2a
. *Done
. 
. *2b Load the data
. import delimited "Assignment_1_Monthly.txt"
{res}{text}(5 vars, 984 obs)

{com}. 
. rename lnu02300000 us_epr
{res}{txt}
{com}. rename flnan fl_nonfarm
{res}{txt}
{com}. rename fllfn fl_lf
{res}{txt}
{com}. rename flbppriv fl_bp
{res}{txt}
{com}. rename date datestring
{res}{txt}
{com}. 
. *2c Turn on a log file
. log using "Problem Set 1", replace
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 1/Problem Set 1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}26 Feb 2021, 07:25:54
{txt}{.-}
{smcl}
{txt}{sf}{ul off}