{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 2/Problem Set 1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Feb 2021, 18:08:56
{txt}
{com}. 
. *2d Generate a monthly date variable (make its display format monthly time, %tm)
. gen datec=date(datestring, "YMD")
{txt}
{com}. gen date=mofd(datec)
{txt}
{com}. format date %tm
{txt}
{com}. 
. *2e tsset your data
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 1939m1 to 2020m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. *2f
. gen ln_us_epr=log(us_epr)
{txt}(108 missing values generated)

{com}. gen ln_fl_nonfarm=log(fl_nonfarm)
{txt}
{com}. gen ln_fl_lf=log(fl_lf)
{txt}(444 missing values generated)

{com}. gen ln_fl_bp=log(fl_bp)
{txt}(588 missing values generated)

{com}. 
. *3a
. corr ln_us_epr l1.ln_us_epr
{txt}(obs=875)

             {c |}                 L.
             {c |} ln_us_~r ln_us_~r
{hline 13}{c +}{hline 18}
   ln_us_epr {c |}
         --. {c |}{res}   1.0000
         {txt}L1. {c |}{res}   0.9758   1.0000

{txt}
{com}. corr ln_fl_nonfarm l1.ln_fl_nonfarm
{txt}(obs=983)

             {c |}                 L.
             {c |} ln_fl_~m ln_fl_~m
{hline 13}{c +}{hline 18}
ln_fl_nonf~m {c |}
         --. {c |}{res}   1.0000
         {txt}L1. {c |}{res}   0.9999   1.0000

{txt}
{com}. corr ln_fl_lf l1.ln_fl_lf
{txt}(obs=539)

             {c |}                 L.
             {c |} ln_fl_lf ln_fl_lf
{hline 13}{c +}{hline 18}
    ln_fl_lf {c |}
         --. {c |}{res}   1.0000
         {txt}L1. {c |}{res}   0.9997   1.0000

{txt}
{com}. corr ln_fl_bp l1.ln_fl_bp
{txt}(obs=395)

             {c |}                 L.
             {c |} ln_fl_bp ln_fl_bp
{hline 13}{c +}{hline 18}
    ln_fl_bp {c |}
         --. {c |}{res}   1.0000
         {txt}L1. {c |}{res}   0.9470   1.0000

{txt}
{com}. 
. *3b
. ac ln_us_epr, saving(ac_ln_us_epr.gph, replace)
{res}{txt}(file ac_ln_us_epr.gph saved)

{com}. pac ln_us_epr, saving(pac_ln_us_epr.gph, replace)
{res}{txt}(file pac_ln_us_epr.gph saved)

{com}. graph combine ac_ln_us_epr.gph pac_ln_us_epr.gph, saving(combo_ln_us_epr.gph, replace)
{res}{txt}(file combo_ln_us_epr.gph saved)

{com}. 
. ac ln_fl_nonfarm, saving(ac_ln_fl_nonfarm.gph, replace)
{res}{txt}(file ac_ln_fl_nonfarm.gph saved)

{com}. pac ln_fl_nonfarm, saving(pac_ln_fl_nonfarm.gph, replace)
{res}{txt}(file pac_ln_fl_nonfarm.gph saved)

{com}. graph combine ac_ln_fl_nonfarm.gph pac_ln_fl_nonfarm.gph, saving(combo_ln_fl_nonfarm.gph, replace)
{res}{txt}(file combo_ln_fl_nonfarm.gph saved)

{com}. 
. ac ln_fl_lf, saving(ac_ln_fl_lf.gph, replace)
{res}{txt}(file ac_ln_fl_lf.gph saved)

{com}. pac ln_fl_lf, saving(pac_ln_fl_lf.gph, replace)
{res}{txt}(file pac_ln_fl_lf.gph saved)

{com}. graph combine ac_ln_fl_lf.gph pac_ln_fl_lf.gph, saving(combo_ln_fl_lf.gph, replace)
{res}{txt}(file combo_ln_fl_lf.gph saved)

{com}. 
. ac ln_fl_bp, saving(ac_ln_fl_bp.gph, replace)
{res}{txt}(file ac_ln_fl_bp.gph saved)

{com}. pac ln_fl_bp, saving(pac_ln_fl_bp.gph, replace)
{res}{txt}(file pac_ln_fl_bp.gph saved)

{com}. graph combine ac_ln_fl_bp.gph pac_ln_fl_bp.gph, saving(combo_ln_fl_bp.gph, replace)
{res}{txt}(file combo_ln_fl_bp.gph saved)

{com}. 
. *3c
. dfuller ln_us_epr, trend regress

{txt}Dickey-Fuller test for unit root                   Number of obs   = {res}      875

{txt}{col 32}{hline 10} Interpolated Dickey-Fuller {hline 9}
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
{hline 78}
 Z(t)         {res}    -4.020            -3.960            -3.410            -3.120
{txt}{hline 78}
MacKinnon approximate p-value for Z(t) = {res}0.0082

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} D.ln_us_epr{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ln_us_epr {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0392314{col 26}{space 2} .0097585{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4}-.0583843{col 67}{space 3}-.0200784
{txt}{space 12} {c |}
{space 6}_trend {c |}{col 14}{res}{space 2} 4.02e-06{col 26}{space 2} 1.84e-06{col 37}{space 1}    2.18{col 46}{space 3}0.030{col 54}{space 4} 3.99e-07{col 67}{space 3} 7.63e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1583652{col 26}{space 2} .0392952{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} .0812411{col 67}{space 3} .2354894
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. dfuller ln_fl_nonfarm, trend regress

{txt}Dickey-Fuller test for unit root                   Number of obs   = {res}      983

{txt}{col 32}{hline 10} Interpolated Dickey-Fuller {hline 9}
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
{hline 78}
 Z(t)         {res}    -0.653            -3.960            -3.410            -3.120
{txt}{hline 78}
MacKinnon approximate p-value for Z(t) = {res}0.9761

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.           {col 15}{c |}
{col 1}ln_fl_nonfarm{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ln_fl_nonfarm {c |}
{space 10}L1. {c |}{col 15}{res}{space 2} -.001659{col 27}{space 2} .0025399{col 38}{space 1}   -0.65{col 47}{space 3}0.514{col 55}{space 4}-.0066433{col 68}{space 3} .0033253
{txt}{space 13} {c |}
{space 7}_trend {c |}{col 15}{res}{space 2} 6.93e-07{col 27}{space 2} 8.56e-06{col 38}{space 1}    0.08{col 47}{space 3}0.935{col 55}{space 4}-.0000161{col 68}{space 3} .0000175
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .0159216{col 27}{space 2} .0160282{col 38}{space 1}    0.99{col 47}{space 3}0.321{col 55}{space 4}-.0155318{col 68}{space 3} .0473751
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. dfuller ln_fl_lf, trend regress

{txt}Dickey-Fuller test for unit root                   Number of obs   = {res}      539

{txt}{col 32}{hline 10} Interpolated Dickey-Fuller {hline 9}
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
{hline 78}
 Z(t)         {res}    -1.724            -3.960            -3.410            -3.120
{txt}{hline 78}
MacKinnon approximate p-value for Z(t) = {res}0.7400

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  D.ln_fl_lf{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_fl_lf {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0076457{col 26}{space 2} .0044337{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-.0163552{col 67}{space 3} .0010639
{txt}{space 12} {c |}
{space 6}_trend {c |}{col 14}{res}{space 2} 7.40e-06{col 26}{space 2} 8.61e-06{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-9.52e-06{col 67}{space 3} .0000243
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .120517{col 26}{space 2} .0676628{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.0123997{col 67}{space 3} .2534337
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. dfuller ln_fl_bp, trend regress

{txt}Dickey-Fuller test for unit root                   Number of obs   = {res}      395

{txt}{col 32}{hline 10} Interpolated Dickey-Fuller {hline 9}
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
{hline 78}
 Z(t)         {res}    -3.256            -3.984            -3.424            -3.130
{txt}{hline 78}
MacKinnon approximate p-value for Z(t) = {res}0.0738

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  D.ln_fl_bp{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_fl_bp {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0545463{col 26}{space 2} .0167509{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.0874792{col 67}{space 3}-.0216134
{txt}{space 12} {c |}
{space 6}_trend {c |}{col 14}{res}{space 2}-.0000375{col 26}{space 2} .0000734{col 37}{space 1}   -0.51{col 46}{space 3}0.609{col 54}{space 4}-.0001817{col 67}{space 3} .0001067
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5091679{col 26}{space 2} .1583766{col 37}{space 1}    3.21{col 46}{space 3}0.001{col 54}{space 4} .1977942{col 67}{space 3} .8205417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. *4
. regress d.ln_fl_nonfarm l(1/48)d.ln_fl_nonfarm l(12/24)d.ln_us_epr l(1/18, 24)d.ln_fl_lf date

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       515
{txt}{hline 13}{c +}{hline 34}   F(81, 433)      = {res}    15.48
{txt}       Model {c |} {res} .050091055        81  .000618408   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  .01729335       433  .000039938   {txt}R-squared       ={res}    0.7434
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6954
{txt}       Total {c |} {res} .067384405       514  .000131098   {txt}Root MSE        =   {res} .00632

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.           {col 15}{c |}
{col 1}ln_fl_nonfarm{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ln_fl_nonfarm {c |}
{space 10}LD. {c |}{col 15}{res}{space 2}-.1441103{col 27}{space 2}  .059346{col 38}{space 1}   -2.43{col 47}{space 3}0.016{col 55}{space 4}-.2607523{col 68}{space 3}-.0274683
{txt}{space 9}L2D. {c |}{col 15}{res}{space 2}-.1332106{col 27}{space 2}  .060728{col 38}{space 1}   -2.19{col 47}{space 3}0.029{col 55}{space 4}-.2525689{col 68}{space 3}-.0138524
{txt}{space 9}L3D. {c |}{col 15}{res}{space 2} .0520745{col 27}{space 2}  .060831{col 38}{space 1}    0.86{col 47}{space 3}0.392{col 55}{space 4}-.0674863{col 68}{space 3} .1716354
{txt}{space 9}L4D. {c |}{col 15}{res}{space 2} .1139409{col 27}{space 2} .0609067{col 38}{space 1}    1.87{col 47}{space 3}0.062{col 55}{space 4}-.0057687{col 68}{space 3} .2336504
{txt}{space 9}L5D. {c |}{col 15}{res}{space 2}  .066288{col 27}{space 2} .0611891{col 38}{space 1}    1.08{col 47}{space 3}0.279{col 55}{space 4}-.0539766{col 68}{space 3} .1865526
{txt}{space 9}L6D. {c |}{col 15}{res}{space 2} .1944856{col 27}{space 2} .0614959{col 38}{space 1}    3.16{col 47}{space 3}0.002{col 55}{space 4}  .073618{col 68}{space 3} .3153532
{txt}{space 9}L7D. {c |}{col 15}{res}{space 2} .0759452{col 27}{space 2} .0622902{col 38}{space 1}    1.22{col 47}{space 3}0.223{col 55}{space 4}-.0464836{col 68}{space 3} .1983741
{txt}{space 9}L8D. {c |}{col 15}{res}{space 2} .0829208{col 27}{space 2} .0631492{col 38}{space 1}    1.31{col 47}{space 3}0.190{col 55}{space 4}-.0411963{col 68}{space 3}  .207038
{txt}{space 9}L9D. {c |}{col 15}{res}{space 2} .2532911{col 27}{space 2} .0930772{col 38}{space 1}    2.72{col 47}{space 3}0.007{col 55}{space 4} .0703519{col 68}{space 3} .4362303
{txt}{space 8}L10D. {c |}{col 15}{res}{space 2} .1403499{col 27}{space 2} .0960901{col 38}{space 1}    1.46{col 47}{space 3}0.145{col 55}{space 4}-.0485112{col 68}{space 3}  .329211
{txt}{space 8}L11D. {c |}{col 15}{res}{space 2} .1893271{col 27}{space 2} .0946093{col 38}{space 1}    2.00{col 47}{space 3}0.046{col 55}{space 4} .0033766{col 68}{space 3} .3752776
{txt}{space 8}L12D. {c |}{col 15}{res}{space 2} .4685154{col 27}{space 2} .0957577{col 38}{space 1}    4.89{col 47}{space 3}0.000{col 55}{space 4} .2803077{col 68}{space 3} .6567232
{txt}{space 8}L13D. {c |}{col 15}{res}{space 2} .0758492{col 27}{space 2} .1003991{col 38}{space 1}    0.76{col 47}{space 3}0.450{col 55}{space 4}-.1214811{col 68}{space 3} .2731795
{txt}{space 8}L14D. {c |}{col 15}{res}{space 2} .0089228{col 27}{space 2} .1008964{col 38}{space 1}    0.09{col 47}{space 3}0.930{col 55}{space 4}-.1893847{col 68}{space 3} .2072303
{txt}{space 8}L15D. {c |}{col 15}{res}{space 2} .0490602{col 27}{space 2} .1006788{col 38}{space 1}    0.49{col 47}{space 3}0.626{col 55}{space 4}-.1488197{col 68}{space 3}   .24694
{txt}{space 8}L16D. {c |}{col 15}{res}{space 2}-.0187785{col 27}{space 2} .1013922{col 38}{space 1}   -0.19{col 47}{space 3}0.853{col 55}{space 4}-.2180605{col 68}{space 3} .1805035
{txt}{space 8}L17D. {c |}{col 15}{res}{space 2} .0547956{col 27}{space 2} .1017669{col 38}{space 1}    0.54{col 47}{space 3}0.591{col 55}{space 4}-.1452228{col 68}{space 3} .2548141
{txt}{space 8}L18D. {c |}{col 15}{res}{space 2} .0863921{col 27}{space 2} .1011552{col 38}{space 1}    0.85{col 47}{space 3}0.394{col 55}{space 4}-.1124241{col 68}{space 3} .2852084
{txt}{space 8}L19D. {c |}{col 15}{res}{space 2}  -.25835{col 27}{space 2} .1016689{col 38}{space 1}   -2.54{col 47}{space 3}0.011{col 55}{space 4}-.4581759{col 68}{space 3}-.0585241
{txt}{space 8}L20D. {c |}{col 15}{res}{space 2}-.1621826{col 27}{space 2} .1009034{col 38}{space 1}   -1.61{col 47}{space 3}0.109{col 55}{space 4} -.360504{col 68}{space 3} .0361389
{txt}{space 8}L21D. {c |}{col 15}{res}{space 2}-.0839614{col 27}{space 2} .1033319{col 38}{space 1}   -0.81{col 47}{space 3}0.417{col 55}{space 4}-.2870559{col 68}{space 3} .1191331
{txt}{space 8}L22D. {c |}{col 15}{res}{space 2}-.1719582{col 27}{space 2} .1017154{col 38}{space 1}   -1.69{col 47}{space 3}0.092{col 55}{space 4}-.3718755{col 68}{space 3} .0279592
{txt}{space 8}L23D. {c |}{col 15}{res}{space 2} .0347504{col 27}{space 2} .1011416{col 38}{space 1}    0.34{col 47}{space 3}0.731{col 55}{space 4}-.1640391{col 68}{space 3} .2335399
{txt}{space 8}L24D. {c |}{col 15}{res}{space 2} .2927769{col 27}{space 2} .0998811{col 38}{space 1}    2.93{col 47}{space 3}0.004{col 55}{space 4} .0964647{col 68}{space 3}  .489089
{txt}{space 8}L25D. {c |}{col 15}{res}{space 2} .1178616{col 27}{space 2}  .098203{col 38}{space 1}    1.20{col 47}{space 3}0.231{col 55}{space 4}-.0751523{col 68}{space 3} .3108754
{txt}{space 8}L26D. {c |}{col 15}{res}{space 2} .0999885{col 27}{space 2} .0980021{col 38}{space 1}    1.02{col 47}{space 3}0.308{col 55}{space 4}-.0926304{col 68}{space 3} .2926074
{txt}{space 8}L27D. {c |}{col 15}{res}{space 2}-.1283723{col 27}{space 2} .0980801{col 38}{space 1}   -1.31{col 47}{space 3}0.191{col 55}{space 4}-.3211445{col 68}{space 3}    .0644
{txt}{space 8}L28D. {c |}{col 15}{res}{space 2}-.2031139{col 27}{space 2} .0980964{col 38}{space 1}   -2.07{col 47}{space 3}0.039{col 55}{space 4}-.3959182{col 68}{space 3}-.0103096
{txt}{space 8}L29D. {c |}{col 15}{res}{space 2}-.2892074{col 27}{space 2}  .097907{col 38}{space 1}   -2.95{col 47}{space 3}0.003{col 55}{space 4}-.4816395{col 68}{space 3}-.0967753
{txt}{space 8}L30D. {c |}{col 15}{res}{space 2}-.5772115{col 27}{space 2} .0991658{col 38}{space 1}   -5.82{col 47}{space 3}0.000{col 55}{space 4}-.7721176{col 68}{space 3}-.3823054
{txt}{space 8}L31D. {c |}{col 15}{res}{space 2} .6236058{col 27}{space 2} .1020615{col 38}{space 1}    6.11{col 47}{space 3}0.000{col 55}{space 4} .4230083{col 68}{space 3} .8242034
{txt}{space 8}L32D. {c |}{col 15}{res}{space 2} .1870999{col 27}{space 2} .1073141{col 38}{space 1}    1.74{col 47}{space 3}0.082{col 55}{space 4}-.0238215{col 68}{space 3} .3980212
{txt}{space 8}L33D. {c |}{col 15}{res}{space 2} .1426809{col 27}{space 2} .1091241{col 38}{space 1}    1.31{col 47}{space 3}0.192{col 55}{space 4}-.0717978{col 68}{space 3} .3571596
{txt}{space 8}L34D. {c |}{col 15}{res}{space 2} .1068341{col 27}{space 2} .1078243{col 38}{space 1}    0.99{col 47}{space 3}0.322{col 55}{space 4}-.1050899{col 68}{space 3} .3187581
{txt}{space 8}L35D. {c |}{col 15}{res}{space 2}-.0794067{col 27}{space 2} .1078368{col 38}{space 1}   -0.74{col 47}{space 3}0.462{col 55}{space 4}-.2913554{col 68}{space 3} .1325421
{txt}{space 8}L36D. {c |}{col 15}{res}{space 2} .1327386{col 27}{space 2} .1064489{col 38}{space 1}    1.25{col 47}{space 3}0.213{col 55}{space 4}-.0764823{col 68}{space 3} .3419594
{txt}{space 8}L37D. {c |}{col 15}{res}{space 2}-.0639028{col 27}{space 2}  .099194{col 38}{space 1}   -0.64{col 47}{space 3}0.520{col 55}{space 4}-.2588645{col 68}{space 3} .1310589
{txt}{space 8}L38D. {c |}{col 15}{res}{space 2} -.048562{col 27}{space 2} .0984536{col 38}{space 1}   -0.49{col 47}{space 3}0.622{col 55}{space 4}-.2420684{col 68}{space 3} .1449445
{txt}{space 8}L39D. {c |}{col 15}{res}{space 2} .0871388{col 27}{space 2} .0975069{col 38}{space 1}    0.89{col 47}{space 3}0.372{col 55}{space 4} -.104507{col 68}{space 3} .2787845
{txt}{space 8}L40D. {c |}{col 15}{res}{space 2}-.1442082{col 27}{space 2} .0974565{col 38}{space 1}   -1.48{col 47}{space 3}0.140{col 55}{space 4}-.3357548{col 68}{space 3} .0473384
{txt}{space 8}L41D. {c |}{col 15}{res}{space 2}-.0032331{col 27}{space 2} .0966638{col 38}{space 1}   -0.03{col 47}{space 3}0.973{col 55}{space 4}-.1932218{col 68}{space 3} .1867555
{txt}{space 8}L42D. {c |}{col 15}{res}{space 2} .0938246{col 27}{space 2} .0970599{col 38}{space 1}    0.97{col 47}{space 3}0.334{col 55}{space 4}-.0969425{col 68}{space 3} .2845917
{txt}{space 8}L43D. {c |}{col 15}{res}{space 2}-.3559573{col 27}{space 2} .0966539{col 38}{space 1}   -3.68{col 47}{space 3}0.000{col 55}{space 4}-.5459264{col 68}{space 3}-.1659882
{txt}{space 8}L44D. {c |}{col 15}{res}{space 2}-.0089124{col 27}{space 2} .0978207{col 38}{space 1}   -0.09{col 47}{space 3}0.927{col 55}{space 4}-.2011749{col 68}{space 3} .1833501
{txt}{space 8}L45D. {c |}{col 15}{res}{space 2}-.0882528{col 27}{space 2} .0966085{col 38}{space 1}   -0.91{col 47}{space 3}0.361{col 55}{space 4}-.2781327{col 68}{space 3} .1016272
{txt}{space 8}L46D. {c |}{col 15}{res}{space 2} .1086727{col 27}{space 2}  .091884{col 38}{space 1}    1.18{col 47}{space 3}0.238{col 55}{space 4}-.0719214{col 68}{space 3} .2892668
{txt}{space 8}L47D. {c |}{col 15}{res}{space 2} .0313382{col 27}{space 2}  .091654{col 38}{space 1}    0.34{col 47}{space 3}0.733{col 55}{space 4}-.1488038{col 68}{space 3} .2114803
{txt}{space 8}L48D. {c |}{col 15}{res}{space 2} .0609195{col 27}{space 2}  .091323{col 38}{space 1}    0.67{col 47}{space 3}0.505{col 55}{space 4} -.118572{col 68}{space 3}  .240411
{txt}{space 13} {c |}
{space 4}ln_us_epr {c |}
{space 8}L12D. {c |}{col 15}{res}{space 2}-.0155085{col 27}{space 2} .1744885{col 38}{space 1}   -0.09{col 47}{space 3}0.929{col 55}{space 4}-.3584584{col 68}{space 3} .3274413
{txt}{space 8}L13D. {c |}{col 15}{res}{space 2}-.3056076{col 27}{space 2}  .153451{col 38}{space 1}   -1.99{col 47}{space 3}0.047{col 55}{space 4} -.607209{col 68}{space 3}-.0040062
{txt}{space 8}L14D. {c |}{col 15}{res}{space 2}-.5608006{col 27}{space 2} .1545155{col 38}{space 1}   -3.63{col 47}{space 3}0.000{col 55}{space 4}-.8644942{col 68}{space 3} -.257107
{txt}{space 8}L15D. {c |}{col 15}{res}{space 2}-.3645519{col 27}{space 2} .1519838{col 38}{space 1}   -2.40{col 47}{space 3}0.017{col 55}{space 4}-.6632696{col 68}{space 3}-.0658341
{txt}{space 8}L16D. {c |}{col 15}{res}{space 2} .0029936{col 27}{space 2} .1580302{col 38}{space 1}    0.02{col 47}{space 3}0.985{col 55}{space 4}-.3076081{col 68}{space 3} .3135954
{txt}{space 8}L17D. {c |}{col 15}{res}{space 2} .0422232{col 27}{space 2} .1559561{col 38}{space 1}    0.27{col 47}{space 3}0.787{col 55}{space 4} -.264302{col 68}{space 3} .3487483
{txt}{space 8}L18D. {c |}{col 15}{res}{space 2} .3199335{col 27}{space 2} .1565006{col 38}{space 1}    2.04{col 47}{space 3}0.042{col 55}{space 4} .0123381{col 68}{space 3} .6275288
{txt}{space 8}L19D. {c |}{col 15}{res}{space 2}  -.07463{col 27}{space 2} .0988972{col 38}{space 1}   -0.75{col 47}{space 3}0.451{col 55}{space 4}-.2690083{col 68}{space 3} .1197484
{txt}{space 8}L20D. {c |}{col 15}{res}{space 2} .0625226{col 27}{space 2} .0999685{col 38}{space 1}    0.63{col 47}{space 3}0.532{col 55}{space 4}-.1339614{col 68}{space 3} .2590065
{txt}{space 8}L21D. {c |}{col 15}{res}{space 2}-.0436852{col 27}{space 2} .1002131{col 38}{space 1}   -0.44{col 47}{space 3}0.663{col 55}{space 4}-.2406498{col 68}{space 3} .1532795
{txt}{space 8}L22D. {c |}{col 15}{res}{space 2} .2231831{col 27}{space 2} .0985078{col 38}{space 1}    2.27{col 47}{space 3}0.024{col 55}{space 4} .0295703{col 68}{space 3}  .416796
{txt}{space 8}L23D. {c |}{col 15}{res}{space 2}-.0081188{col 27}{space 2} .0960409{col 38}{space 1}   -0.08{col 47}{space 3}0.933{col 55}{space 4}-.1968832{col 68}{space 3} .1806456
{txt}{space 8}L24D. {c |}{col 15}{res}{space 2}-.2688582{col 27}{space 2} .1616447{col 38}{space 1}   -1.66{col 47}{space 3}0.097{col 55}{space 4}-.5865639{col 68}{space 3} .0488476
{txt}{space 13} {c |}
{space 5}ln_fl_lf {c |}
{space 10}LD. {c |}{col 15}{res}{space 2} .1762398{col 27}{space 2} .0704433{col 38}{space 1}    2.50{col 47}{space 3}0.013{col 55}{space 4} .0377865{col 68}{space 3} .3146932
{txt}{space 9}L2D. {c |}{col 15}{res}{space 2}-.1356975{col 27}{space 2} .0715783{col 38}{space 1}   -1.90{col 47}{space 3}0.059{col 55}{space 4}-.2763815{col 68}{space 3} .0049866
{txt}{space 9}L3D. {c |}{col 15}{res}{space 2}-.1659446{col 27}{space 2} .0715828{col 38}{space 1}   -2.32{col 47}{space 3}0.021{col 55}{space 4}-.3066375{col 68}{space 3}-.0252517
{txt}{space 9}L4D. {c |}{col 15}{res}{space 2}-.0977864{col 27}{space 2} .0709175{col 38}{space 1}   -1.38{col 47}{space 3}0.169{col 55}{space 4}-.2371718{col 68}{space 3}  .041599
{txt}{space 9}L5D. {c |}{col 15}{res}{space 2}-.1364495{col 27}{space 2} .0722069{col 38}{space 1}   -1.89{col 47}{space 3}0.059{col 55}{space 4} -.278369{col 68}{space 3}   .00547
{txt}{space 9}L6D. {c |}{col 15}{res}{space 2}-.2270642{col 27}{space 2} .0723796{col 38}{space 1}   -3.14{col 47}{space 3}0.002{col 55}{space 4}-.3693234{col 68}{space 3}-.0848051
{txt}{space 9}L7D. {c |}{col 15}{res}{space 2}-.1332104{col 27}{space 2} .0724525{col 38}{space 1}   -1.84{col 47}{space 3}0.067{col 55}{space 4}-.2756127{col 68}{space 3} .0091919
{txt}{space 9}L8D. {c |}{col 15}{res}{space 2}-.2396185{col 27}{space 2} .0727056{col 38}{space 1}   -3.30{col 47}{space 3}0.001{col 55}{space 4}-.3825182{col 68}{space 3}-.0967187
{txt}{space 9}L9D. {c |}{col 15}{res}{space 2}-.1256755{col 27}{space 2}  .079465{col 38}{space 1}   -1.58{col 47}{space 3}0.114{col 55}{space 4}-.2818605{col 68}{space 3} .0305095
{txt}{space 8}L10D. {c |}{col 15}{res}{space 2} -.180737{col 27}{space 2} .0797732{col 38}{space 1}   -2.27{col 47}{space 3}0.024{col 55}{space 4}-.3375278{col 68}{space 3}-.0239463
{txt}{space 8}L11D. {c |}{col 15}{res}{space 2} -.005726{col 27}{space 2} .0808095{col 38}{space 1}   -0.07{col 47}{space 3}0.944{col 55}{space 4}-.1645537{col 68}{space 3} .1531017
{txt}{space 8}L12D. {c |}{col 15}{res}{space 2} .0558537{col 27}{space 2} .1334055{col 38}{space 1}    0.42{col 47}{space 3}0.676{col 55}{space 4}-.2063492{col 68}{space 3} .3180565
{txt}{space 8}L13D. {c |}{col 15}{res}{space 2} .0173463{col 27}{space 2} .1262683{col 38}{space 1}    0.14{col 47}{space 3}0.891{col 55}{space 4}-.2308286{col 68}{space 3} .2655213
{txt}{space 8}L14D. {c |}{col 15}{res}{space 2} .2969825{col 27}{space 2} .1275491{col 38}{space 1}    2.33{col 47}{space 3}0.020{col 55}{space 4} .0462901{col 68}{space 3}  .547675
{txt}{space 8}L15D. {c |}{col 15}{res}{space 2}  .125207{col 27}{space 2} .1266497{col 38}{space 1}    0.99{col 47}{space 3}0.323{col 55}{space 4}-.1237177{col 68}{space 3} .3741316
{txt}{space 8}L16D. {c |}{col 15}{res}{space 2}-.0665773{col 27}{space 2} .1288379{col 38}{space 1}   -0.52{col 47}{space 3}0.606{col 55}{space 4}-.3198027{col 68}{space 3}  .186648
{txt}{space 8}L17D. {c |}{col 15}{res}{space 2}-.1292395{col 27}{space 2} .1273895{col 38}{space 1}   -1.01{col 47}{space 3}0.311{col 55}{space 4}-.3796182{col 68}{space 3} .1211391
{txt}{space 8}L18D. {c |}{col 15}{res}{space 2}-.2883037{col 27}{space 2} .1278108{col 38}{space 1}   -2.26{col 47}{space 3}0.025{col 55}{space 4}-.5395104{col 68}{space 3} -.037097
{txt}{space 8}L24D. {c |}{col 15}{res}{space 2} .2278015{col 27}{space 2} .1255369{col 38}{space 1}    1.81{col 47}{space 3}0.070{col 55}{space 4} -.018936{col 68}{space 3} .4745389
{txt}{space 13} {c |}
{space 9}date {c |}{col 15}{res}{space 2}-8.65e-06{col 27}{space 2} 3.19e-06{col 38}{space 1}   -2.72{col 47}{space 3}0.007{col 55}{space 4}-.0000149{col 68}{space 3}-2.39e-06
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .0058495{col 27}{space 2} .0022338{col 38}{space 1}    2.62{col 47}{space 3}0.009{col 55}{space 4} .0014592{col 68}{space 3} .0102399
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict res, residual
{txt}(469 missing values generated)

{com}. ac res, saving(p4_ac.gph, replace)
{res}{txt}(file p4_ac.gph saved)

{com}. pac res, saving(p4_pac.gph, replace)
{res}{txt}(file p4_pac.gph saved)

{com}. graph combine p4_ac.gph p4_pac.gph, saving(p4_combo.gph, replace)
{res}{txt}(file p4_combo.gph saved)

{com}. estat bgodfrey, lag(1/48)

{txt}Breusch-Godfrey LM test for autocorrelation
{hline 13}{c TT}{hline 61}
{col 5}lags({it:p}){col 14}{c |}{col 25}chi2{col 44}df{col 63}Prob > chi2
{hline 13}{c +}{hline 61}
{col 6}  1{col 14}{c |}{res}{col 20}     0.617{col 43}  1{col 63}  0.4321
{txt}{col 6}  2{col 14}{c |}{res}{col 20}     1.630{col 43}  2{col 63}  0.4427
{txt}{col 6}  3{col 14}{c |}{res}{col 20}     1.639{col 43}  3{col 63}  0.6506
{txt}{col 6}  4{col 14}{c |}{res}{col 20}     1.665{col 43}  4{col 63}  0.7970
{txt}{col 6}  5{col 14}{c |}{res}{col 20}     1.730{col 43}  5{col 63}  0.8850
{txt}{col 6}  6{col 14}{c |}{res}{col 20}     2.757{col 43}  6{col 63}  0.8387
{txt}{col 6}  7{col 14}{c |}{res}{col 20}     8.252{col 43}  7{col 63}  0.3109
{txt}{col 6}  8{col 14}{c |}{res}{col 20}     8.536{col 43}  8{col 63}  0.3830
{txt}{col 6}  9{col 14}{c |}{res}{col 20}     8.707{col 43}  9{col 63}  0.4648
{txt}{col 6} 10{col 14}{c |}{res}{col 20}     8.803{col 43} 10{col 63}  0.5509
{txt}{col 6} 11{col 14}{c |}{res}{col 20}     9.015{col 43} 11{col 63}  0.6205
{txt}{col 6} 12{col 14}{c |}{res}{col 20}    10.913{col 43} 12{col 63}  0.5364
{txt}{col 6} 13{col 14}{c |}{res}{col 20}    12.697{col 43} 13{col 63}  0.4715
{txt}{col 6} 14{col 14}{c |}{res}{col 20}    12.775{col 43} 14{col 63}  0.5443
{txt}{col 6} 15{col 14}{c |}{res}{col 20}    14.075{col 43} 15{col 63}  0.5198
{txt}{col 6} 16{col 14}{c |}{res}{col 20}    15.212{col 43} 16{col 63}  0.5091
{txt}{col 6} 17{col 14}{c |}{res}{col 20}    15.284{col 43} 17{col 63}  0.5751
{txt}{col 6} 18{col 14}{c |}{res}{col 20}    18.315{col 43} 18{col 63}  0.4351
{txt}{col 6} 19{col 14}{c |}{res}{col 20}    18.317{col 43} 19{col 63}  0.5014
{txt}{col 6} 20{col 14}{c |}{res}{col 20}    19.893{col 43} 20{col 63}  0.4647
{txt}{col 6} 21{col 14}{c |}{res}{col 20}    19.920{col 43} 21{col 63}  0.5263
{txt}{col 6} 22{col 14}{c |}{res}{col 20}    20.203{col 43} 22{col 63}  0.5704
{txt}{col 6} 23{col 14}{c |}{res}{col 20}    20.218{col 43} 23{col 63}  0.6287
{txt}{col 6} 24{col 14}{c |}{res}{col 20}    20.362{col 43} 24{col 63}  0.6760
{txt}{col 6} 25{col 14}{c |}{res}{col 20}    21.112{col 43} 25{col 63}  0.6864
{txt}{col 6} 26{col 14}{c |}{res}{col 20}    21.381{col 43} 26{col 63}  0.7221
{txt}{col 6} 27{col 14}{c |}{res}{col 20}    23.290{col 43} 27{col 63}  0.6693
{txt}{col 6} 28{col 14}{c |}{res}{col 20}    24.359{col 43} 28{col 63}  0.6624
{txt}{col 6} 29{col 14}{c |}{res}{col 20}    25.322{col 43} 29{col 63}  0.6615
{txt}{col 6} 30{col 14}{c |}{res}{col 20}    27.716{col 43} 30{col 63}  0.5855
{txt}{col 6} 31{col 14}{c |}{res}{col 20}    28.706{col 43} 31{col 63}  0.5846
{txt}{col 6} 32{col 14}{c |}{res}{col 20}    28.728{col 43} 32{col 63}  0.6330
{txt}{col 6} 33{col 14}{c |}{res}{col 20}    29.272{col 43} 33{col 63}  0.6533
{txt}{col 6} 34{col 14}{c |}{res}{col 20}    30.894{col 43} 34{col 63}  0.6207
{txt}{col 6} 35{col 14}{c |}{res}{col 20}    30.897{col 43} 35{col 63}  0.6666
{txt}{col 6} 36{col 14}{c |}{res}{col 20}    33.834{col 43} 36{col 63}  0.5720
{txt}{col 6} 37{col 14}{c |}{res}{col 20}    35.071{col 43} 37{col 63}  0.5597
{txt}{col 6} 38{col 14}{c |}{res}{col 20}    35.519{col 43} 38{col 63}  0.5847
{txt}{col 6} 39{col 14}{c |}{res}{col 20}    38.229{col 43} 39{col 63}  0.5049
{txt}{col 6} 40{col 14}{c |}{res}{col 20}    38.448{col 43} 40{col 63}  0.5402
{txt}{col 6} 41{col 14}{c |}{res}{col 20}    38.548{col 43} 41{col 63}  0.5801
{txt}{col 6} 42{col 14}{c |}{res}{col 20}    39.001{col 43} 42{col 63}  0.6034
{txt}{col 6} 43{col 14}{c |}{res}{col 20}    39.107{col 43} 43{col 63}  0.6408
{txt}{col 6} 44{col 14}{c |}{res}{col 20}    39.122{col 43} 44{col 63}  0.6804
{txt}{col 6} 45{col 14}{c |}{res}{col 20}    39.431{col 43} 45{col 63}  0.7061
{txt}{col 6} 46{col 14}{c |}{res}{col 20}    39.812{col 43} 46{col 63}  0.7278
{txt}{col 6} 47{col 14}{c |}{res}{col 20}    40.011{col 43} 47{col 63}  0.7550
{txt}{col 6} 48{col 14}{c |}{res}{col 20}    40.617{col 43} 48{col 63}  0.7664
{txt}{hline 13}{c BT}{hline 61}
{col 25}H0: no serial correlation

{com}. 
. *5
. reg d.ln_fl_nonfarm l(0/4)d.ln_fl_bp if tin(1948m1,2020m1)

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       380
{txt}{hline 13}{c +}{hline 34}   F(5, 374)       = {res}     2.97
{txt}       Model {c |} {res}  .00146591         5  .000293182   {txt}Prob > F        ={res}    0.0122
{txt}    Residual {c |} {res} .036972226       374  .000098856   {txt}R-squared       ={res}    0.0381
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0253
{txt}       Total {c |} {res} .038438136       379   .00010142   {txt}Root MSE        =   {res} .00994

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.          {col 14}{c |}
{col 1}ln_fl_nonf~m{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_fl_bp {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0043445{col 26}{space 2} .0035864{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-.0113965{col 67}{space 3} .0027075
{txt}{space 9}LD. {c |}{col 14}{res}{space 2}-.0115113{col 26}{space 2} .0040594{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.0194935{col 67}{space 3}-.0035291
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .0019871{col 26}{space 2} .0041056{col 37}{space 1}    0.48{col 46}{space 3}0.629{col 54}{space 4}-.0060858{col 67}{space 3}   .01006
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0011778{col 26}{space 2} .0040768{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-.0091941{col 67}{space 3} .0068385
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2}-.0028262{col 26}{space 2} .0036121{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-.0099287{col 67}{space 3} .0042763
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0015358{col 26}{space 2} .0005101{col 37}{space 1}    3.01{col 46}{space 3}0.003{col 54}{space 4} .0005328{col 67}{space 3} .0025387
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. newey d.ln_fl_nonfarm l(0/4)d.ln_fl_bp if tin(1948m1,2020m1), lag(4)

{txt}Regression with Newey-West standard errors{col 49}Number of obs{col 67}= {res}       380
{txt}maximum lag: {res}4{col 49}{txt}F(  5,       374){col 67}= {res}      4.01
{col 49}{txt}Prob > F{col 67}= {res}    0.0015

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}D.          {col 14}{c |}{col 26}  Newey-West
{col 1}ln_fl_nonf~m{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_fl_bp {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0043445{col 26}{space 2}  .003622{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-.0114665{col 67}{space 3} .0027776
{txt}{space 9}LD. {c |}{col 14}{res}{space 2}-.0115113{col 26}{space 2} .0036606{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0187093{col 67}{space 3}-.0043133
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .0019871{col 26}{space 2} .0043475{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-.0065616{col 67}{space 3} .0105358
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0011778{col 26}{space 2}  .004813{col 37}{space 1}   -0.24{col 46}{space 3}0.807{col 54}{space 4}-.0106416{col 67}{space 3}  .008286
{txt}{space 8}L4D. {c |}{col 14}{res}{space 2}-.0028262{col 26}{space 2}  .003664{col 37}{space 1}   -0.77{col 46}{space 3}0.441{col 54}{space 4}-.0100308{col 67}{space 3} .0043783
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0015358{col 26}{space 2} .0004154{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .0007189{col 67}{space 3} .0023526
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/guslipkin/Documents/Spring2020/CAP 4763 ~ Time Series/Problem Sets/Problem Set 2/Problem Set 1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}26 Feb 2021, 18:09:11
{txt}{.-}
{smcl}
{txt}{sf}{ul off}